[
  {
    "videoUrl": null,
    "_id": "5iirGhYDYyfLyLsiVDOmzo",
    "contactNo": "+917483840583",
    "email": "chaturth.r149@gmail.com",
    "graduationYear": 2025,
    "designation": "Fourth Year Student",
    "course": "B.Tech. in Computer Science and Engineering",
    "memorableExperience": "My journey at IIIT Dharwad has been an enriching experience that balances rigorous academics with a vibrant campus life. The demanding coursework and collaborative projects have provided invaluable technical knowledge and real-world problem-solving skills. Equally meaningful were the study sessions and informal discussions with friends, where we exchanged ideas and supported each other’s learning. These experiences fostered both academic growth and a strong sense of community, making my time at IIIT Dharwad professionally rewarding and personally memorable.",
    "encouragement": "To all my juniors at IIIT Dharwad, embrace every opportunity that comes your way and make the most of your time here. The journey may be challenging, but every project, lecture, and study session is shaping you into a capable professional. Don’t hesitate to dive deep into subjects and seek out collaborative projects—they’ll help you gain practical skills and insights that are invaluable. Remember, you’re surrounded by a supportive community of peers and professors who want to see you succeed. Stay curious, persevere through challenges, and keep pushing your limits. Your hard work will undoubtedly pay off, and the memories and friendships you make here will last a lifetime.",
    "name": "Chaturth R",
    "achievements": "",
    "testimonial": "Studying at IIIT Dharwad has been a transformative journey, one that has profoundly shaped my technical skills and critical thinking abilities. The institute’s curriculum is meticulously designed to provide a strong foundation in core computer science concepts while also allowing us to explore emerging technologies through hands-on projects. The faculty's dedication and guidance, combined with an environment that fosters collaboration and innovation, have truly empowered me to push my boundaries and prepare myself for the industry. I am incredibly grateful for the skills, knowledge, and opportunities I’ve gained at IIIT Dharwad, which I believe will be invaluable as I step forward in my career.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/66181ef66641b8ddd5aec735b630e1b0b4e9f1d0-689x886.jpg"
  },
  {
    "testimonial": "",
    "encouragement": "Nothing is impossible trust the process and keep optimism",
    "videoUrl": null,
    "name": "Yasharth Dubey",
    "contactNo": "+91 7300912510",
    "email": "yasharthdubey5@gmail.com",
    "graduationYear": 2023,
    "designation": "Software developer",
    "achievements": "- Gsoc 21 ( participant )\n- Gsoc 22,23 ( mentor )\n- ICPC regionalist ( 20,21 )\n- Codechef 6*\n- SDE intern at Amazon\n- SDE 1 at blinkit\n- SIH finalist\n- Codeforces candidate master\n- github externship mentor\n- chapter president codechef return_0\ninterned at newton school, crib and many more\n",
    "memorableExperience": "College's first codechef 6 star",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/efeb33be8657af108c32aa408ab6552e2289f934-3120x4160.jpg",
    "_id": "7NrOZup7oQaHEnxspSK93q",
    "course": "B Tech  in Computer Science and Engineering"
  },
  {
    "encouragement": "To all the juniors, my advice is to embrace every opportunity you get—whether it’s joining a club, organizing events, or simply learning something new. Challenges may seem daunting at first, but each one is an opportunity to grow. Stay curious, keep exploring, and remember that you are part of an amazing community that is here to support you every step of the way.\r\n",
    "videoUrl": null,
    "_id": "Gla93ADLUobPD0Qy81TvCe",
    "contactNo": "+919405923750",
    "graduationYear": 2025,
    "achievements": "- IEEE Student Branch IIIT Dharwad Chair\r\n- Core Member and Technical Team Co-lead for Hack2Future, IIIT Dharwad's First National-Level Hackathon\r\n- IEEE Day 2024 Ambassador\r\n- IKS Student Research Intern in 2023. Worked on a project related to \"Sound Symbolism\".\r\n- Developed projects including a Fake News Detection System, and an ASCVD Risk Prediction Model\r\n- Research Paper in Review: Co-authored a study on diabetes management using CGM devices, exploring their impact on treatment and quality of life, currently under review in Biostatistics journal.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/2cb5799fe6764ccefea4eeb6db6eefc6bac2ee0a-595x589.jpg",
    "name": "Chinmayee Patankar",
    "email": "chinmayeepatankar270503@gmail.com",
    "designation": "Fourth Year Student",
    "course": "B.Tech. in Computer Science and Engineering",
    "testimonial": "My journey at IIIT Dharwad has been transformative, fostering academic, personal, and professional growth. With support from professors and peers, I explored technical fields ranging from Web Development to AI, Machine Learning, and cybersecurity. Serving as Chair of the IEEE Student Branch Club allowed me to engage in events that foster innovation and teamwork, preparing me for post-college challenges. Through workshops and seminars, I gained valuable tech-driven skills, while faculty guidance inspired me to pursue my passions wholeheartedly. Collaborating with peers on innovative solutions deepened my appreciation for teamwork and creativity.",
    "memorableExperience": "One of my most memorable experiences was being part of the organizing team for Hack2Future, the first national-level hackathon at our college. I was Co-lead of the Technical Team in the hackathon. From coordinating with participants and judges to managing the technical setup, every moment was a lesson in collaboration, leadership, and resilience. The energy and passion of the participants was truly inspiring to witness. It was a privilege to work alongside an amazing group of mentors, organizers, and participants. Every moment was a rewarding learning journey. I will cherish this experience for the rest of my life."
  },
  {
    "videoUrl": null,
    "_id": "Gla93ADLUobPD0Qy81YqZJ",
    "email": "siddharthrbhandari2002@gmail.com",
    "graduationYear": 2024,
    "achievements": "- EthIndia'22 Winner \n- Mitacs GRI'23 at SMU🇨🇦 \n- Publications at CODS-COMAD and IEEE-Big Data\n",
    "testimonial": "As an alumnus of IIIT Dharwad, I am proud to reflect on the invaluable support and opportunities the college provided. My time there was enriched by memorable friendships, dedicated faculty, and the invaluable guidance of seniors. IIIT Dharwad’s cultural and technical clubs fostered both personal growth and professional development, helping me build a strong foundation for my career. The college’s commitment to continuous improvement and student success makes me proud to be an alumnus of IIIT Dharwad.",
    "memorableExperience": "Me at IIIT Dharwad is filled with unforgettable memories — from the friendships I formed to the enriching learning and research experiences. Late nights spent on assignments, the continuous support from Manjunath Sir, and the countless discussions and permissions needed for cultural and technical events made every moment special. These experiences not only shaped my academic journey but also fostered a deep sense of community and growth.",
    "encouragement": "My advice to juniors is to stay focused on your goals and make the most of this invaluable time. Build strong connections with friends, faculty, and seniors — these are the relationships that will give you lifelong memories and support. Never hesitate to ask for help when you need it. Respect the journey, and stay committed to your ambitions. These moments are precious, and they won't come back — make them count.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/22ff39deaa0132ebce20e1f3405857656676a28c-3024x4032.jpg",
    "name": "Siddharth Bhandari",
    "contactNo": "+91 6376112947",
    "designation": "Software Engineer ",
    "course": "B.Tech. in  Data Science and Artificial Intelligence"
  },
  {
    "name": "Avinav Kashyap",
    "email": "avinav04kashyap@gmail.com",
    "course": "B.Tech. in Computer Science and Engineering",
    "testimonial": "IIIT Dharwad has provided me the best peer network around me to learn from ,i get better everyday 1 percent as there is so much knowledge that passes around the air here. I take decision and make them right eventually. It has led me believe me in principle of getting the work done at any cost.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/1162b5cdf58a13412ebb18d56ad9679482ac6d2b-960x1280.jpg",
    "contactNo": "+917644091101",
    "graduationYear": 2025,
    "designation": "Fourth Year Student",
    "achievements": "- 2x Hackathon Wins\n- Ex-Microsoft Learn Student Ambassador\n- CNCF Mentee\n- SWE fellow at Headstarter.ai\n- Builder at buildspace\n- Ex-intern Afame technology\n- 50+TECH BLOGS at HASHNODE\n",
    "memorableExperience": "Most memorable experience is me giving hacakthons ,learning from proffesors, peers. Everyday growing, and taking one step closer to my aim.There is so much to learn from everyone.",
    "encouragement": "Believe in your instincts, work on yourself, and eventually everything will fall into the place. Don't fear anything, keep on doing for the thing you want in your life.Just do it.",
    "videoUrl": null,
    "_id": "Gla93ADLUobPD0Qy82Xul5"
  },
  {
    "course": "B.Tech. in Computer Science and Engineering",
    "videoUrl": null,
    "name": "Chinmay Vijay Shewale ",
    "designation": "Fourth year Student",
    "achievements": "",
    "testimonial": "At IIIT Dharwad, the learning never stops. Every person here brings a unique set of skills and expertise—whether in technology, social engagement, sports, or other pursuits. Being surrounded by such talented individuals inspires me daily, as I learn from their strengths and am continually motivated by the diversity of talents within our community.",
    "memorableExperience": "Practicing and performing with my friends for IIIT Habba, along with the thrill of winning the institute's first-ever hackathon—and my very first hackathon victory—made for an unforgettable experience.",
    "encouragement": "Don’t limit yourself to just academics and placement prep—step out, get involved in clubs, sports, or any social activities. Engage with others, broaden your experiences, and learn from the people around you.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/112313a1a429a2528422e23be4253f7dec7cb537-1067x1600.jpg",
    "_id": "Gla93ADLUobPD0Qy82htnt",
    "contactNo": "+919403051246",
    "email": "shewalechinmay54@gmail.com",
    "graduationYear": 2025
  },
  {
    "achievements": "- Co-author of the research paper titled \"FL-DECO-BC: A Privacy and Provenance Preserving, Provably Secure FL Framework for VANETs,\" accepted for presentation at the prestigious Globecom 2024 3SCity EC2 Workshop in Cape Town, South Africa.\n",
    "testimonial": "My journey at IIIT Dharwad has been like a thrilling roller coaster ride, full of ups and downs, yet bursting with excitement thanks to my amazing friends. The peer group here is exceptional, filled with brilliant minds that constantly inspire me. This institute truly offers a holistic experience, nurturing our growth in every possible way. It's been a fulfilling adventure, and I wouldn't trade it for anything.",
    "memorableExperience": "Reflecting on my time at IIIT Dharwad, the most memorable experiences have undoubtedly been with the incredible friends I’ve made here. We started as strangers but have grown into a close-knit family, many minds moving as one. The joy of dancing, the laughter shared, and the solidarity in both tough and joyous times have made this journey truly unforgettable. Each moment spent together is a testament to the bond we've built and the growth we've experienced.",
    "encouragement": "To my juniors at IIIT Dharwad: Live life to the fullest and find that perfect balance between professional and personal growth. Immerse yourself in experiences and make memories that you'll cherish forever. When you look back on your B.Tech life, it should feel like stepping back into the best times, full of joy and camaraderie. All the best, everyone—embrace every moment and make the most of this incredible journey!",
    "videoUrl": null,
    "_id": "Gla93ADLUobPD0Qy82ii3X",
    "name": "Saran Kumar Nukala",
    "contactNo": "+91 9505461461",
    "email": "nvskumar2003@gmail.com",
    "course": "B.Tech. in  Computer Science and Engineering",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/057a80860d0221319daebca82c373fe487f213b8-1401x1221.png",
    "graduationYear": 2025,
    "designation": "Fourth Year Student"
  },
  {
    "memorableExperience": "Reflect on the friendships you built during your time at IIIT Dharwad. Maybe there was a specific moment or adventure with your friends that stands out, such as late-night study sessions, group projects, or outings.",
    "encouragement": " IIIT Dharwad is a blend of individual effort, community support, and institutional resources, all aimed at fostering an environment where students can thrive and reach their full potential.\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "name": "Guntreddy Hemanth Kumar",
    "contactNo": "+918074537142",
    "course": "B.Tech Electronics and Communication Engineering",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/9331d46ac86a03356968ff0e1aff814059f95953-567x506.jpg",
    "videoUrl": null,
    "_id": "Gla93ADLUobPD0Qy82kxwY",
    "email": "guntreddyhemanth@gmail.com",
    "graduationYear": 2025,
    "designation": "Fourth Year Student",
    "achievements": "- Won the prestigious Fly High Challenge Hackathon organized by NxtWave India Techno Solutions, earning a sponsored trip to Dubai.\n-Teaching Assistant Intern at NxtWave",
    "testimonial": "IIIT Dharwad provided me with a strong foundation in software development through practical, hands-on learning and supportive faculty. The collaborative environment pushed me to excel in hackathons and industry-relevant projects, preparing me confidently for a career in tech."
  },
  {
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/7d2d24bd64effc1ca7d7dbc696e9ebc292a1fbf8-511x633.jpg",
    "videoUrl": null,
    "_id": "Gla93ADLUobPD0Qy82qAnF",
    "contactNo": "9036343044",
    "email": "saisathviklucky4444@gmail.com",
    "graduationYear": 2025,
    "course": "B.Tech ECE",
    "achievements": "",
    "testimonial": "Learnt many things at the time in IIIT Dharwad like:\r\nVLSI Domain related Concepts\r\nBeing independent\r\nSpending the least possible",
    "encouragement": "If you're VLSI aspirant, work from the start with picture-perfect plan; don't forget to enjoy everything you do and don't waste time on enjoyment if you want to enjoy the future",
    "name": "Sai Sathvik G B",
    "designation": "4th year Student/VLSI Aspirant",
    "memorableExperience": "Nothing much but want to relive my entire B.Tech."
  },
  {
    "graduationYear": 2025,
    "designation": "Fourth Year Student",
    "testimonial": "As I reflect on my journey at IIIT Dharwad, I am filled with gratitude and pride. My time here has been transformative, shaping not only my academic skills but also my personal growth.\nThe campus life at IIIT Dharwad is filled with opportunities for creativity and collaboration. From spirited discussions in the club meetings to the adrenaline rush of basketball tournaments, every moment contributed to my growth. Ultimately, IIIT Dharwad has been a pivotal part of my academic and personal development. As I embark on my professional journey, I am committed to leveraging the knowledge and skills I’ve gained here to contribute to innovative projects that can make a positive impact in the tech landscape.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/a2d0ce21b62d1003c4ac1548f0fdfb2f9ccd55d6-1214x1189.jpg",
    "videoUrl": null,
    "_id": "Gla93ADLUobPD0Qy82r5OK",
    "contactNo": "+919821589838",
    "email": "heth.koorma@gmail.com",
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "-Won the Adapt Track - \"Best Use Gamification and AI in Personalised Learning\" in Make-A-Ton 7.0 Hackathon.",
    "memorableExperience": "During my time at IIIT Dharwad, I created lasting memories through various trips which provided a refreshing break from studies and strengthened our bonds, filled with laughter and shared adventures. Equally treasured were the late-night talks in our hostels, where we exchanged dreams, tackled challenges, and brainstormed ideas.",
    "encouragement": "Embrace every opportunity that comes your way. This journey may be challenging at times, but it is also incredibly rewarding. Do not hesitate to engage in extracurricular activities, participate in discussions, and make the most of your time here. Make connections with your peers, as these friendships will become invaluable sources of support and inspiration.",
    "name": "Heth Tharun Koorma"
  },
  {
    "memorableExperience": "One of my most memorable experiences was when I first completed an original song on Logic Pro X. It was a challenging yet rewarding process from composing the initial melody to layering each track and polishing the sound.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/01ed6cc55a1b46a9d1b3ab06fba4eadbdf3321de-300x400.jpg",
    "email": "hanson12567@gmail.com",
    "designation": "Fourth Year Student",
    "achievements": "",
    "encouragement": "you’re capable of achieving amazing things!",
    "videoUrl": null,
    "_id": "Gla93ADLUobPD0Qy83WYEU",
    "name": "Padavatan Hanson George",
    "contactNo": "+918688591345",
    "graduationYear": 2025,
    "course": "B.Tech. in Electronics and Communication Engineering",
    "testimonial": "As a student of IIIT Dharwad, it's been a wonderful journey to be part of this college, especially, thankful for the Resources regarding projects and research work which made me solid enough throughout the learning"
  },
  {
    "_id": "Gla93ADLUobPD0Qy83cXu8",
    "contactNo": "+918528469069",
    "graduationYear": 2025,
    "course": "B.Tech. in Data Science and Artificial Intelligence",
    "achievements": "",
    "encouragement": "Life has no final destination; it's a journey. Keep learning, keep improving, and be the best version of yourself every day.",
    "name": "Anubhav Gupta",
    "email": "anubhavg0910@gmail.com",
    "designation": "Fourth Year Student",
    "testimonial": "My journey at the IIIT Dharwad has been transformative. The faculty are supportive, always encouraging us to learn and grow. With great opportunities for real-world experience, IIIT Dharwad is a fantastic place to build skills and prepare for a successful career.",
    "memorableExperience": "My most memorable experiences at IIIT Dharwad have been during our vibrant festival celebrations like Diwali, Ganesh Chaturthi and Krishna Janmashtami. It’s not just about the place, it’s the people who make these celebrations truly special and unforgettable.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/a3470a67ecdd903380ff59e11b1247209ac47b08-1655x1655.jpg",
    "videoUrl": null
  },
  {
    "designation": "Fourth Year Student",
    "course": "B.Tech. in Computer Science and Engineering",
    "testimonial": "My time at IIIT Dharwad has been a journey of growth, shaped by both challenges and unforgettable moments shared with inspiring friends and mentors. Pursuing my passions in machine learning, software development, and leadership, I’ve gained invaluable skills and lifelong friendships. This community has played a crucial role in helping me realize my potential, and the memories from this place will remain a part of me forever.",
    "memorableExperience": "At IIIT Dharwad, I’ve created lasting memories—from refreshing trips that strengthened bonds to late-night hostel talks filled with dreams and ideas. Hackathons with professors and peers fueled my growth, bringing me closer to my goals. Each experience, whether tackling challenges together or celebrating small victories, filled this journey with camaraderie and unforgettable moments.",
    "encouragement": "To all my juniors and peers at IIIT Dharwad, step out of your comfort zone, seek collaboration, and build practical skills and lasting friendships. You’re surrounded by a supportive community that wants you to succeed, so stay curious and resilient. Believe in yourself, work hard, and trust that your efforts will lead you toward success.",
    "_id": "Gla93ADLUobPD0Qy83oEEd",
    "graduationYear": 2025,
    "achievements": "",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/f476e5eb9bb2a41dfca1c12e3e6845b5dcefa857-1832x1954.jpg",
    "videoUrl": null,
    "name": "Gangineni Aravind",
    "contactNo": "+917569776348",
    "email": "gangineniaravind17@gmail.com"
  },
  {
    "_id": "Gla93ADLUobPD0Qy83wcCq",
    "email": "jaynitpatel11062001@gmail.com",
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "- Achieved a top 100 global ranking in several CodeChef competitions\n- Co-founded the innovative startup Camp+ during my third year of college\n- Successfully secured a position at the renowned tech company, Increff",
    "testimonial": "IIIT Dharwad is an excellent college and has improved even further with the new batches and faculties that have come. A lot of good investments have been made in the college’s infrastructure and people....",
    "encouragement": "Make the most of your college years!",
    "videoUrl": null,
    "name": "Jaynit Patel",
    "contactNo": "+919106758871",
    "graduationYear": 2023,
    "designation": "SDE-1",
    "memorableExperience": "2 most memorable thing for me is my friends (Phoenix) and getting placed on 1st Day of placements",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/71f1b607753e37017da865df42e70f73ff5241c4-648x800.jpg"
  },
  {
    "videoUrl": null,
    "name": "Akkineni Saras Chandrika",
    "contactNo": "+919493993993",
    "email": "saraschandrika28@gmail.com",
    "achievements": "- Co-authored a paper titled \"\"Real-Time MRI Synthesis from Text Using a Two-Stage Pipeline for Pronunciation Training,\"\" presenting a novel approach for generating MRI visuals from text to aid pronunciation training. This work bridges advancements in speech synthesis and medical imaging.\n- Qualified for the second round of the prestigious Young Turks contest, choosing the Data and AI track to further develop and showcase my skills in data-driven AI solutions.\n- Completed a project on facial skin type classification using machine learning, \ndemonstrating practical applications of ML in the health-tech sector.",
    "testimonial": "IIIT Dharwad has greatly shaped my academic and professional journey in data science and AI. The college offers state-of-the-art infrastructure that enhances learning, and the collaborative environment with talented peers and supportive faculty has enriched my experience. I’m grateful for the opportunities to engage in hands-on projects, which have equipped me with practical skills for real-world challenges.",
    "memorableExperience": "One of my most memorable experiences was leading a team project on voice activity detection using deep learning. Overcoming challenges in data preprocessing and model optimization taught me the value of teamwork and adaptability. The supportive environment at IIIT Dharwad, with its emphasis on practical learning, played a crucial role in our project’s success.",
    "_id": "Gla93ADLUobPD0Qy84e26b",
    "graduationYear": 2025,
    "designation": "Fourth Year Student",
    "course": "B.Tech. in Data Science and Artificial Intelligence",
    "encouragement": "Embrace every learning opportunity, no matter how challenging it may seem. Keep pushing boundaries, and don’t hesitate to seek guidance from faculty and peers. IIIT Dharwad offers resources to help you excel—make the most of them!\r\n\r\n",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/2f5b5308f17f9743fb68c827e971998bac4bcbbb-662x735.jpg"
  },
  {
    "contactNo": "+916282354218",
    "email": "azmi.nabeel.dev@gmail.com",
    "designation": "Third Year Student",
    "achievements": "- ICPC Regionalist 2023 \n",
    "testimonial": "IIIT Dharwad has been an incredible place for growth and learning. The academic structure is designed to encourage creativity and critical thinking, with the faculty always providing invaluable guidance. Being part of active clubs like Return 0 has given me opportunities to sharpen my skills and collaborate with talented peers. The college’s commitment to career readiness, through various industry interactions and events, ensures we are well-prepared for future challenges. I feel fortunate to be part of such a forward-thinking and supportive community.",
    "encouragement": "Make the most of your college years by staying curious and exploring new opportunities. Get involved in the vibrant communities, whether through clubs or activities, as they offer valuable experiences and growth. Embrace both challenges and successes—they’ll shape your journey and help you discover your passions.",
    "videoUrl": null,
    "_id": "Gla93ADLUobPD0Qy88n51B",
    "name": "Azmi Nabeel",
    "graduationYear": 2026,
    "course": "B.Tech. in Electronics and Communication Engineering",
    "memorableExperience": "Time spent with friends, organizing Hack2Future and other tech events in college.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/f2f7355585ee76ec8a6de2b6a8c09d457913bc49-800x800.jpg"
  },
  {
    "_id": "Gla93ADLUobPD0Qy89ZMqa",
    "contactNo": "+918766790939",
    "email": "shreyasbulbule007@gmail.com",
    "testimonial": "I had an amazing time at IIIT Dharwad learning and applying knowledge. We met wonderful teachers here who inspired us to think critically. Special mention to Manjunath sir who guided and mentored us beyond academics.",
    "memorableExperience": "Organizing technical events with clubs and participating in hackathons.",
    "encouragement": "Learn to apply your knowledge beyond classrooms. ",
    "videoUrl": null,
    "name": " Shreyas Srinivas Bulbule",
    "graduationYear": 2024,
    "designation": "Full Stack Developer ",
    "course": "B.Tech. Data Science and Artificial Intelligence ",
    "achievements": "- Winner 1st place at DevHack 2023 a Hackathon by IIT Dharwad.\n-  Finalist at ”Blockchain for Good” Binance Ideathon 2022 conducted by Binance and i4c.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/4b49d05fe494d5e893b8acd7c05e035594a14915-400x400.jpg"
  },
  {
    "videoUrl": null,
    "_id": "HZIB0LLkBhvyiAmq6bjDPK",
    "name": "Nikhil Karthik",
    "contactNo": "+919901630824",
    "email": "nikhilkarthik241103@gmail.com",
    "graduationYear": 2025,
    "designation": "Fourth Year Student",
    "course": "B.Tech. in Computer Science and Engineering",
    "testimonial": "One of the greatest aspects of being at IIIT is the close-knit, collaborative community. As a smaller, specialized college, we constantly support and learn from each other, creating an environment of mutual growth. The faculty here are genuinely dedicated, offering guidance both academically and personally, and opening up a world of opportunities that drive us forward!",
    "achievements": "- I have a well-rounded professional background, having contributed to WikiEdu as part of the Google Summer of Code program, freelanced for emerging startups, and interned with a couple of reputable companies. \n- I have achieved success in competitive programming, securing wins in 4-5 hackathons.",
    "memorableExperience": "I have cherished countless memories during my time at IIIT Dharwad, from playing games to celebrating festivals and events with friends. Each occasion, whether it was a simple gathering or a lively festivity, was filled with laughter and joy. These moments of shared fun and celebration have created bonds and experiences that will remain close to my heart forever.",
    "encouragement": "To my juniors, I want to say: enjoy every bit of college life. Dive into campus activities, participate in events, and don't hold back from making memories that will last a lifetime. Get involved, try new things, and build friendships that will stay with you long after you leave. Make the most of your time here, and remember that balancing hard work with fun is the key to a fulfilling journey at IIIT Dharwad.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/71c62619b05f8a5a5d84b4838bf53d33851bbc79-1416x1592.jpg"
  },
  {
    "_id": "HZIB0LLkBhvyiAmq6rdYdS",
    "email": "chandana2003sonu@gmail.com",
    "course": "B.Tech. in Data Science and Artificial Intelligence",
    "achievements": "-Spark FP-Growth Algorithm: Boosted data processing speed by 30% on a five-node cluster.\n-IoT Security: Developed a blockchain-based system, enhancing device privacy by 20%.\n-Twitter Sentiment Analysis: Achieved 85% accuracy in real-time insights.\n-Healthcare ML Models: Improved facility classification accuracy by 15% in e-health.\n-Hackathon Win: Built a tourism app in Flutter, increasing user base by 10% and securing an internship.",
    "testimonial": "Studying here has been an enriching journey. The faculty, resources, and projects have prepared me well for the future. I've grown both professionally and personally, gaining skills that I know will be invaluable.",
    "encouragement": "Embrace challenges and stay curious! Every problem you solve builds your skills and resilience. Remember, there’s always room to learn, so take on projects that might seem difficult at first—you'll be amazed at what you can achieve.",
    "name": "Chandana R ",
    "contactNo": "+917411316691",
    "graduationYear": 2025,
    "designation": "Fourth Year Student",
    "memorableExperience": "One of my most memorable experiences in college was the balance between diving into challenging tech projects and embracing the lighter side of campus life. Long hours spent on collaborative work were broken up by late-night chai runs, spontaneous road trips, and endless laughter with friends. The blend of intense learning and unforgettable moments with friends made college life a truly enriching and joyful journey.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/f9dfe1d4e29ce15259420b80096ed64c9bca58d8-638x1002.jpg",
    "videoUrl": null
  },
  {
    "designation": "Software Developer",
    "achievements": "- As a proud alumnus of IIIT Dharwad, I am excited to share that I recently received the ‘Rockstar Rookie’ award at my company.",
    "testimonial": "As a full-stack developer at Deloitte, I owe a significant part of my journey to the foundations built at IIIT Dharwad. The curriculum, thoughtfully designed to bridge theory and cutting-edge technology, prepared me not only to understand \ncore principles but to thrive in the fast-paced tech world. The dedication of the faculty and the hands-on learning environment encouraged me to pursue excellence and explore both frontend and backend technologies confidently and I am grateful for the role the college has played in shaping my career.",
    "encouragement": "To my juniors at IIIT Dharwad: You’re in an incredible place to build a strong career foundation. Embrace every opportunity, whether it’s a project, competition, or learning from your professors. Dive deep into what interests you, and challenge yourself with practical work—it’s what will set you apart. Consistency, curiosity, and a proactive approach go a long way. Make the most of your time here; you’re on the path to great things",
    "contactNo": "+919573498701",
    "course": "B.Tech. in Computer Science and Engineering",
    "memorableExperience": "My time at IIIT Dharwad is filled with memories I’ll always cherish. Some of my best experiences were on the volleyball court with friends, where we bonded over countless late-night practices and friendly matches. Beyond academics, these moments taught me teamwork, resilience, and the value of friendships that have become like family. Whether it was late-night study sessions, group projects, or simply hanging out on campus, each experience added something unique to my journey.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/e5e787f191c3fa6bfbecb98425bd3434aec1074d-345x427.jpg",
    "videoUrl": null,
    "_id": "HZIB0LLkBhvyiAmq6vil5C",
    "name": "Peluru Goutam",
    "email": "pelurugoutam9@gmail.com",
    "graduationYear": 2023
  },
  {
    "videoUrl": null,
    "name": "Sathwik Narkedimilli",
    "contactNo": "+91 9845526132",
    "designation": "Full Stack Web3 Blockchian Developer",
    "course": "BTech. in Computer Science and Engineering",
    "memorableExperience": "All days here are memorable.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/129ed92ebbda7e32e8d6ae5e7880ef47a35e3f79-1248x1600.jpg",
    "_id": "HZIB0LLkBhvyiAmq6w5zbi",
    "email": "sathwik.narkedimilli29@gmail.com",
    "graduationYear": 2025,
    "achievements": "- Publication In IEEE Globecom 2024 Conference, paper Title \"FL-DECO-BC: A privacy and provenance preserving, Provably secure FL framework for VANETs \"",
    "testimonial": "IIIT Dharwad: where coding’s cooler than ice, brains buzz like bees, and every byte’s a blast!",
    "encouragement": "Keep coding, keep dreaming, and remember: every bug squashed is one step closer to greatness!"
  },
  {
    "graduationYear": 2024,
    "achievements": "Chess and football champion at intra iiit tournament ",
    "testimonial": "Studying at IIIT Dharwad as a Computer Science student was an incredibly fulfilling experience. Despite the challenges brought on by the so-called recession, our journey proved that resilience and determination could overcome even the toughest job markets. We not only managed to secure positions—whether through campus placements or off-campus opportunities—but did so with the unwavering support of our mentors",
    "memorableExperience": "",
    "encouragement": "Keep experimenting, coding, and learning from every project you take on, even the ones that feel small. Each line of code adds up, and every bug you solve is a step forward. Don't be afraid to ask questions, collaborate, and dive deep into topics that excite you. Remember, confidence comes with experience, so don’t rush – growth is a process.",
    "_id": "HZIB0LLkBhvyiAmq6wvTI6",
    "name": "Jay Prakash ",
    "contactNo": "+918009787905",
    "email": "jayp66613@gmail.com",
    "designation": "Full stack developer ",
    "course": "B.Tech. in Computer Science and Engineering",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/0ba9ec11eb26353acd2b1c2d2f6c1042233a8a7f-3024x4032.jpg",
    "videoUrl": null
  },
  {
    "memorableExperience": "Interacting with my seniors about placements and research in Data Science where they gave me invaluable advice and guidance through which I paved a clear path for myself. Also the various meetings and interactions I had with my professors who helped me bag internships through their guidance and support.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/9e5e727f633e4a3f7f6dc69c2cae124b14a39106-356x494.jpg",
    "_id": "HZIB0LLkBhvyiAmq6x3X8Y",
    "contactNo": "+91 8879818749",
    "achievements": "- Published 2 research Papers (in sector of Data Science) at  ICCSC-2024 IEEE & RCAAI-2024 (I presented this paper in online mode).\n- Completed Data Science Internship at NIT Sikkim and Web Development Internship at IIT Gandhinagar.\n- Completed 6 months corporate Internship at TAM Media Research Pvt Ltd as a Data Analyst Intern. (Hybrid mode)\n",
    "testimonial": "As a dedicated data science student with a strong foundation in AI and machine learning, I am passionate about applying data-driven insights to solve real-world problems. I've worked on diverse projects that demonstrate my skills in data analysis, modeling, and generative AI. Currently, I am developing an optimal advertisement generation system that integrates market research with generative AI, focusing on innovative and impactful solutions for the industry.",
    "encouragement": "Communicate more with your seniors, professors and don't be shy, don't be afraid to explore new things and strive for whatever relevant catches your eye. Be narcissistic but not as much as me :) .",
    "videoUrl": null,
    "name": "Tanush Korgaokar",
    "email": "tanushtans2508@gmail.com",
    "graduationYear": 2025,
    "designation": "Fourth Year Student",
    "course": "B.Tech. Data Science and Artificial Intelligence "
  },
  {
    "memorableExperience": "One of my most memorable experiences at IIIT Dharwad was working closely with faculty members like Dr. Manjunath KV and Dr. Girish GN on research projects, particularly the energy-efficient 3D CNN architectures for lung cancer detection, which helped me understand the real-world impact of AI in healthcare. The collaborative environment at IIIT Dharwad, combined with the support from professors and peers, has shaped my technical growth and professional journey in profound ways.",
    "encouragement": "To my fellow students, I encourage you to step out of your comfort zone and seize every opportunity that comes your way. My journey from being a student to working on research projects at prestigious institutions like IIT Bombay and collaborating with international scholars has taught me that persistence and continuous learning are key. Don't be afraid to take on challenging projects and maintain a balance between academic excellence and practical experience. The technology field is constantly evolving, and there are endless opportunities for those who are willing to learn and adapt",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/e66928c71aebe01a53ab9dd2741125e1fe06a59a-1621x2050.jpg",
    "_id": "HZIB0LLkBhvyiAmq6xA64k",
    "name": "Vinayak",
    "email": "vinayakmr2003@gmail.com",
    "achievements": "- Selected for Amazon Machine Learning Summer School '24.\n- Published two research papers at IEEE TALE 2024 and ET Society T4E 2024.\n- Won the Ganglia Tech Collegiate Hackathon.\n- Finalist at HackFest NITTE.\n- Secured internships at IIT Bombay, IIT Madras, NIT Puducherry, IIIT Sricity, and startups like Vocab.AI.",
    "testimonial": "As a BTech student in Data Science and AI at IIIT Dharwad, I've had the opportunity to work on cutting-edge technologies and meaningful projects. My journey has been enriched through research internships, industry experience, and academic excellence that has helped me grow both professionally and personally.",
    "videoUrl": null,
    "contactNo": "+919110414767",
    "graduationYear": 2025,
    "designation": "Fourth year Student",
    "course": "B.Tech. in  Data Science and Artificial Intelligence"
  },
  {
    "graduationYear": 2026,
    "designation": "Third Year Student",
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "- Computer Vision Intern at e-Yantra Summer Internship (e-YSIP, May-July 2024), IIT Bombay\n- Semi-Finalist in e-Yantra Robotics Competition (e-YRC 2023-24)",
    "testimonial": "My experience with the college has been truly rewarding. IIIT Dharwad offers a wealth of opportunities aimed at fostering both personal and professional growth among its students. The college supports us through a range of programs, workshops, and events designed to equip us with essential skills and knowledge for our future careers. Additionally, the professors here are not only highly knowledgeable in their fields but also exceptionally approachable and supportive. They are always willing to help us deepen our understanding, discuss innovative ideas, and guide us through academic challenges. This supportive learning environment has greatly enriched my time here and has made my journey at IIIT Dharwad both enjoyable and impactful.",
    "_id": "HZIB0LLkBhvyiAmq6xeBEE",
    "contactNo": "+917304319408",
    "memorableExperience": "During the E-Yantra Robotics competition, my teammates and I often worked late into the night, and it was inspiring to see the dedication and creativity each person contributed. Our collaborative spirit enabled us to brainstorm and refine innovative ideas, which proved essential to our project's success despite the challenges we faced. This experience underscored the strength of teamwork and deepened our bonds as we tackled obstacles together.",
    "encouragement": "I’d encourage every student to keep exploring different technologies and to grab hold of any opportunity that comes along. There’s so much to learn, and each experience adds something valuable, often in ways we don’t expect. Staying curious and open to new challenges really does make a difference in shaping both skills and confidence for whatever comes next.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/ae4618f72d11a09a9f524b9aa8f35d6de3093c48-399x500.jpg",
    "videoUrl": null,
    "name": "Ashutosh Dongre",
    "email": "ashutoshdongre26@gmail.com"
  },
  {
    "email": "karthikavinash01@gmail.com",
    "designation": "Fourth Year Student",
    "course": "B.Tech. in Computer Science and Engineering",
    "memorableExperience": "One of my most memorable experiences was the collaborative environment during our hackathon. Working alongside passionate peers and faculty mentors, I witnessed the true essence of teamwork and innovation.",
    "videoUrl": null,
    "_id": "HZIB0LLkBhvyiAmq6zOqoo",
    "name": "Karthik Avinash",
    "graduationYear": 2025,
    "achievements": "- Third place in Hack4Soc: National Level 24 hour Hackathon at RVCE Bengaluru.\n- Finalist in EcoEquify Hackathon at BNMIT partnered with IBM SkillsBuild.\n- Co-authored 'Vedalytics' paper accepted at IEEE BigData 2024.\n- Top 2% Elite Gold in \"Problem Solving through programming in C\" (NPTEL IIT Kharagpur).\n- Elite in \"Database Management System\" (NPTEL IIT Kharagpur).\n- Designed a Time Table Generation: Scheduling algorithm for IIIT Dharwad.",
    "testimonial": "IIIT Dharwad has been instrumental in shaping my technical and personal growth. With its supportive faculty and an environment that fosters innovation, the institute provides ample opportunities for students to explore, learn, and thrive in the field of computer science.",
    "encouragement": "Each one of you is unique, with your own path to follow. Find your goal first, and then work steadily towards it. Never compare yourself with others; every setback is just a setup for a comeback.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/f78691fb67c2efc3802a02a5807892551e997d42-960x1280.png",
    "contactNo": "+918050379417"
  },
  {
    "_id": "HZIB0LLkBhvyiAmq71f5PK",
    "contactNo": "+918329558114",
    "email": "jatinkushwaha14@gmail.com",
    "graduationYear": 2026,
    "designation": "Third Year Student",
    "course": "B.Tech. in Data Science and Artificial Intelligence",
    "achievements": "-Solved over 400 problems on LeetCode, demonstrating strong proficiency in data structures and algorithms.\n-Developed a custom neural network from scratch, achieving an accuracy of 92%.",
    "memorableExperience": "One of my most memorable experiences was dedicating time to solve data structures and algorithms problems on. Each problem presented a unique challenge and helped strengthen my problem-solving skills. This journey not only improved my technical expertise but also instilled in me a sense of perseverance and determination.",
    "name": "Jatin Kushwaha",
    "testimonial": "My journey at IIIT Dharwad has been transformative. The curriculum and hands-on projects in machine learning and software development provided me with the foundation and confidence to build impactful applications. The faculty’s support and resources here have been invaluable in honing my problem-solving skills and technical expertise.",
    "encouragement": "If the journey feels tough remember why you started.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/9c3e118c4982d6c06244d460913aee3c206bc8c6-1873x2500.jpg",
    "videoUrl": null
  },
  {
    "designation": "Student at IIM Lucknow",
    "memorableExperience": "I had many memorable experiences during my time at IIIT Dharwad such as being the student representative and discussing student issues with concerned authorities and the lengthy meetings that took place for discussing them. Also, the last minute quick grabbing of breakfast just before classes, late night roaming in the Hubli city, enjoying festive celebrations with faculties and their families, walk around IT park college campus and many more that will be forever engraved in my heart.  ",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/e9cd84b50ceff96b296126cc4b66800272b2ce3f-3393x4160.jpg",
    "course": "PGP(MBA)",
    "achievements": "-  Worked with TCS for 1.5 years as Systems Engineer in their Digital Profile.\n- Successfully converting 10+ top IIM's notably IIM Calcutta and IIM Lucknow.\n- Joining IIM Lucknow in their flagship 2-year PGP program. \n- Interning at GAIL India Limited as Strategy and Marketing Intern.",
    "testimonial": "My time at IIIT Dharwad was both challenging and rewarding, providing a strong foundation in computer science that has greatly benefited my career. A memorable highlight was working on the Writing in Air project under Mr. Arun Chauhan, with invaluable support from professors like Mr. Rajendra Hegadi, Mr. Jagadish, and Mr. Lakshman Mahto. After graduating, I worked as a Systems Engineer at TCS before transitioning to pursue an MBA, securing offers from top IIMs and joining IIM Lucknow in 2023. I am deeply grateful to IIIT Dharwad for its quality education and supportive community.",
    "encouragement": "Dear Juniors, college is a journey where every challenge is a chance to grow. Engineering can be demanding but rewarding, so don’t hesitate to step out of your comfort zone—take on tough projects, join clubs, and seize new opportunities to build resilience and discover your strengths. Use the resources around you—professors, classmates, and the community—and don’t hesitate to seek help. Every step, however small, brings you closer to your goals. Stay curious, believe in yourself, and trust that your hard work will pay off. Reach out to alums, seniors, or me whenever you need support—you’ve got this!",
    "videoUrl": null,
    "_id": "HZIB0LLkBhvyiAmq73BM58",
    "name": "Rahul Kumar",
    "contactNo": "+91 7988486419",
    "email": "rahulkumar17iiitdwd@gmail.com",
    "graduationYear": 2021
  },
  {
    "email": "makamsujith2004@gmail.com",
    "designation": "Fourth Year Student",
    "course": "B.Tech.  Computer Science and Engineering",
    "testimonial": "IIIT Dharwad has been instrumental in my technical and personal development, providing a supportive environment that encourages learning and innovation. The faculty's commitment and the gradually evolving campus culture make it a place where students can grow and explore their potential. I'm grateful for the opportunities to engage in both academic and extracurricular pursuits that prepare us for future challenges.",
    "encouragement": "",
    "graduationYear": 2025,
    "achievements": "- Research Intern at IISc\n- TCS TECHBYTES Dharwad Regional Runner-UP \n- State Board Topper(Scored 990/1000)\n",
    "memorableExperience": "Runner-Up in Prestigious TCS TechBytes is Memorable",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/05f149be952b883efdf3efdd730ff72bea81f12f-413x531.jpg",
    "videoUrl": "https://cdn.sanity.io/files/t3mxm1b8/production/4446342853768f27ab2349d9c3061e109795a497.jpg",
    "_id": "Iu8h0szulzg7jSo3kz5beX",
    "name": "Sujith Makam",
    "contactNo": "+91 8555042700"
  },
  {
    "testimonial": "My experience at IIIT Dharwad has been deeply rewarding. I’ve had the chance to work on real-world projects under the guidance of supportive professors and alongside talented peers, which has helped me build practical skills in fields like computer vision and software development. The encouragement and approval from faculty have inspired me to tackle challenging projects with confidence. I’m grateful for these opportunities and look forward to applying what I’ve learned to make a positive impact in tech.",
    "memorableExperience": "A memorable experience for me at IIIT Dharwad was the time spent with friends and seniors, engaging in meaningful conversations that deepened my understanding of technology and academia. The thrill of learning became even more vivid as I collaborated on projects, shared knowledge, and gained insights from those ahead of me. Their guidance, coupled with the stimulating environment, fostered a passion for exploration and innovation, making every challenge an exciting opportunity for growth and learning.\r\n",
    "encouragement": "I encourage my juniors to make the most of their time at IIIT Dharwad, not just through extracurricular activities but by embracing the joy of learning. Build strong friendships and network with as many people as you can. If you ever have doubts or new ideas, don't hesitate to reach out to your seniors or faculty. Their support and guidance will help you grow both academically and personally.",
    "_id": "Jpcpbu1e1a7blriZGHitZ7",
    "contactNo": "8977441599",
    "graduationYear": 2026,
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/f44ba939c2c9cca41a13630b00c1f9358930be2a-940x1172.jpg",
    "videoUrl": null,
    "name": "T. V. V. Sai Karthik ",
    "email": "tanuku.saikarthik@gmail.com",
    "designation": "Student",
    "course": "B.Tech Computer Science ",
    "achievements": "I interned at Haply, Inc. As Software Developer, gaining practical experience in product development. I contributed to a weather forecasting project under a professor and was part of the team responsible for developing the college's official website. Additionally, I worked on website development for the Velocity Club to enhance its online presence.\r\n\r\n"
  },
  {
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/080db31cedc7e93ddebb3cfe4dbff8a7e2d22ec6-887x887.jpg",
    "videoUrl": null,
    "_id": "JplNnnoVjWzg3lpd7L5riO",
    "name": "Mohd Zaid Ragib",
    "contactNo": "+918690586044",
    "graduationYear": 2025,
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "- Won Tri-Code Coding competition Organized by return_0 coding club\n- Secured Rank 12 out of 5000+ participants in Elite Coders Compete 2.0 organized by Computer Society of India and Coding Blocks\n- Knight at LeetCode",
    "testimonial": "As a student at IIIT Dharwad, I’ve found the environment here to be incredibly supportive and motivating. The faculty is always approachable and genuinely invested in our learning, while my peers are talented and driven, creating a collaborative atmosphere. There’s a strong focus on coding, with frequent competitive events that draw enthusiastic participation. Our director is highly approachable and committed to our welfare, making IIIT Dharwad an ideal place to grow and excel.",
    "memorableExperience": "",
    "email": "21bcs069@iiitdwd.ac.in",
    "designation": "Fourth Year Student",
    "encouragement": ""
  },
  {
    "graduationYear": 2025,
    "achievements": "- Worked as a Silicon Engineering Intern @Google, focused on power validation for Pixel SoCs.\n- Contributing as an Open Source Developer, started through Google Summer of Code, developing the Chip-design CAD software for The OpenROAD Project (funded by DARPA).\n- Worked as an IoT and Embedded System's Intern @Hindustan Aeronautics Limited.\n- Granted the Indian Academy of Science Research Fellowship to work on a Weather Station Prototype under CSIR-NGRI.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/38a4b58b19fd5bf0b0f48f853d935ac18e5bdb87-5568x3712.jpg",
    "videoUrl": null,
    "name": "Yash Kumar",
    "contactNo": "+91 9681555577",
    "email": "yashkumar3066@gmail.com",
    "designation": "Student",
    "course": "B. Tech Electronics and Communications Engineering",
    "testimonial": "My engineering journey took off well with great support and mentorship from my professors to pursue the field of engineering that I'm passionate about (VLSI). From getting opportunities to learning when to not take the leap, I have had the chance to experience it all.",
    "memorableExperience": "Officially forming our band The Broken Headphones, and performing on multiple events over the college years",
    "encouragement": "As an engineering student, I learnt that, it is not your field of study that makes you a good engineer but how well you learn a new skill efficiently in a short time. Being open to diverse roles in a team and able to build solutions from scarce resources is valuable.",
    "_id": "JplNnnoVjWzg3lpd7LWByM"
  },
  {
    "_id": "JplNnnoVjWzg3lpd7LbHwO",
    "name": "Rakesh Roushan",
    "contactNo": "+91 8340742939",
    "course": "B.Tech. in  Electronics and Communication ",
    "encouragement": "Keep working hard , and try to incorporate skills as much as you can , to join a company or making your own company.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/96bc1900e8a8a3007a3988e9e7b64df1ec222c7f-1220x1222.png",
    "videoUrl": null,
    "email": "rakeshroushan2341@gmail.com",
    "graduationYear": 2024,
    "designation": "Software Engineer ",
    "achievements": "- Gold Medalist ECE 2024,\n- Verihack Winner by Sociocharge ,\n- HackCBS6.0 Web3 Track winner \n- Decentralised Intelligence season 2",
    "testimonial": "Supporting faculty members , enjoyable college life , and good friends helping me to learn skills ",
    "memorableExperience": "Convocation day of our batch  "
  },
  {
    "contactNo": "+916304110817",
    "graduationYear": 2025,
    "encouragement": " I was consistently encouraged by both friends and faculty. My peers and I supported each other through challenging coursework, driving each other to excel academically and in projects. Faculty provided guidance that fostered collaboration and resilience, motivating us to achieve our best",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/04d9d706af819ae8b2ad2149269579537ebda7f6-3000x4000.jpg",
    "videoUrl": null,
    "_id": "JplNnnoVjWzg3lpd7LitQ4",
    "name": "MANCHALA SRINU ",
    "email": "srinu.manchala2003@gmail.com",
    "designation": "Fourth Year Student",
    "course": "CSE",
    "achievements": "- Developed practical skills through projects like a flower classification system using machine learning.\n- Gained programming experience during internships.\n- Active participant in hackathons and technical clubs.\n- Contributed to events, enhancing teamwork and leadership abilities.",
    "testimonial": "The rigorous curriculum and hands-on projects provided a solid foundation in technology and problem-solving. Collaborating with peers fostered teamwork and lifelong friendships, while the campus environment encouraged innovation and personal growth.",
    "memorableExperience": "My time at IIIT Dharwad was filled with unforgettable moments, including outings with friends and festival celebrations. A highlight was my birthday, celebrated with a surprise party organized by friends. We explored nearby tourist spots, strengthening our bonds, and shared the joy of festivals like Diwali and Pongal, creating a sense of community that made our journey truly memorable"
  },
  {
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/da116c8d2079b890be772d2866962f123b632fdd-413x531.jpg",
    "videoUrl": null,
    "_id": "JplNnnoVjWzg3lpd7M3dM6",
    "name": "Nachiket Ganesh Apte",
    "contactNo": "+919819911573",
    "email": "nachiketapte14@gmail.com",
    "designation": "Third Year Student",
    "course": "B.Tech. in Data Science and Artificial Intelligence",
    "memorableExperience": "The late nighters while trying to study for exams and completing assignments. ",
    "encouragement": "This place has more to offer than you might expect. Don’t hesitate to explore it fully and make the most of every opportunity that comes your way!",
    "graduationYear": 2026,
    "achievements": "- Semi-Finalist in E-Yantra Robotics Competition 2023-24 by IIT Bombay.\n- Achieved a CGPA of 9.64 across 4 semesters.",
    "testimonial": "IIIT Dharwad has equipped me not only with technical skills but also with the confidence to present myself to the world. Within this close-knit community, I found a new family that has supported me from day one and continues to do so!"
  },
  {
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/d9b978b68562fb053e889215049ba53523c05c25-1383x1383.jpg",
    "videoUrl": null,
    "contactNo": "+917878340983",
    "graduationYear": 2025,
    "achievements": "- Won EthIndia'23 in Scroll Track\n- Top 10 in ICC-NIUM Hackathon\n- Top 10 in Electhon Hackathon\n- Top Builders of Linea Dev Cook off Hackathon\n- Participated in Hacker House Goa 2024 and stood in the top 200 hackers from 10k+ hackers.\n- Led the Cricket team at Inter-IIIT Team 2024 as Vice-Captain.\n- Serve the Sports Committee as Sports Coordinator (Boys)\n- Done 3 internships with the 3 blockchain communities.\n- Core member of the Biggest Web3 community in India(IBW)\n",
    "testimonial": "The teachers here are exceptional—highly knowledgeable and always supportive, especially during hackathons and projects. Their guidance enhances the learning experience, and the school also offers a great sports environment, creating a well-rounded and motivating atmosphere for students.",
    "memorableExperience": "Sports ",
    "encouragement": "Build in public ",
    "_id": "JplNnnoVjWzg3lpd7M3eh0",
    "name": "Ajay Bhakar",
    "email": "bhakarajay033@gmail.com",
    "designation": "Fourth Year Student",
    "course": "B.Tech. in Computer Science and Engineering"
  },
  {
    "course": "B.Tech. in Computer Science and Engineering",
    "memorableExperience": "One of the most memorable aspects of my time at IIIT Dharwad has been the collaborative and supportive environment fostered by both faculty and peers. The faculty members are always approachable and dedicated to helping students excel, often going beyond the syllabus to provide real-world insights and guidance. The curriculum is thoughtfully designed, offering a balance between theoretical knowledge and practical applications, which has prepared me well for industry challenges. The overall experience has not only strengthened my technical skills but also enriched my understanding of teamwork and continuous learning.\r\n",
    "encouragement": "My advice to juniors is to take full advantage of the opportunities here. Dive into projects, and don’t hesitate to reach out to faculty and peers for guidance. Balance academics with extracurriculars, and be proactive in upskilling, especially in areas relevant to industry trends. Remember, the journey at IIIT Dharwad is as much about personal growth as it is about academic success—embrace both to the fullest.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/dca62bc0a2b212557e65023a38721604bb68e3cf-1500x1500.png",
    "_id": "JplNnnoVjWzg3lpd7RBr7U",
    "email": "sandeepds7273@gmail.com",
    "achievements": "",
    "testimonial": "My experience at IIIT Dharwad has been transformative, providing a rich blend of academic rigor and practical experience. The supportive faculty and well-structured curriculum have equipped me with a strong foundation in both theoretical knowledge and applied skills. IIIT Dharwad has not only nurtured my technical abilities but also instilled essential values of resilience and teamwork, which I will carry forward in my professional journey.",
    "videoUrl": null,
    "name": "Sandeep D S",
    "contactNo": "+91 6361318395",
    "graduationYear": 2026,
    "designation": "Third Year Student"
  },
  {
    "name": "Vinayak Malawadi",
    "email": "malawadivinayak@gmail.com",
    "graduationYear": 2019,
    "designation": "scientist-B",
    "course": "B.Tech. in computer science and Engineering",
    "testimonial": "My experience at IIIT Dharwad has been transformative. From a welcoming, vibrant community to hands-on projects and supportive faculty with real-world insights, I gained both practical skills and lifelong connections. IIIT Dharwad shaped my academic and personal growth, and I am proud to be an alumnus.",
    "memorableExperience": "Being part of the pioneer batch at IIIT Dharwad was an unforgettable journey, defined by close bonds, supportive faculty, and shared milestones. From study sessions to tech fests, every moment, including the thrill of placement season and the pride of convocation, strengthened our friendships and showcased our growth. I’m deeply grateful for the friendships, memories, and invaluable lessons that will last a lifetime.",
    "encouragement": "Use your time here to grow academically and personally. Embrace challenges as steps toward your future, seek support from professors and peers, and get involved in clubs and projects to build skills and connections. Learn from setbacks and make the most of the supportive community around you. Believe in yourself—the journey may be demanding, but it's incredibly rewarding. I look forward to all you’ll achieve!",
    "_id": "JplNnnoVjWzg3lpd7RS0JH",
    "contactNo": "+918861002622",
    "achievements": "- Worked on real-world problem-solving projects that enhanced technical skills and highlighted technology's societal impact.\n- Completed a significant project in machine learning and data analytics, which inspired a Master’s in Signal Processing and Machine Learning.\n- Currently a scientist at CDOT, contributing to indigenous product development aligned with the Atmanirbhar Bharat initiative.\n- Fulfilled by applying knowledge to create self-reliant technology solutions for India.",
    "photoUrl": null,
    "videoUrl": null
  },
  {
    "_id": "JplNnnoVjWzg3lpd7U8MH1",
    "name": "Nithish Chouti",
    "contactNo": "+919493865924",
    "email": "nithishchouti2003@gmail.com",
    "designation": "Fourth Year Student",
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "- Demonstrated commitment to academic excellence and impactful research internships at IIIT Dharwad.\n- Represented the institute at Inter IIIT sports meets, winning medals that highlight personal dedication and team spirit.\n- Completed research internships at NIT Sikkim and IIT Hyderabad, contributing to projects in robotics and machine learning.\n- Held leadership roles in E-Cell and Career Guidance Cell, enhancing project management and team collaboration skills.\n- Achievements reflect a blend of technical knowledge, leadership, and sportsmanship that I am proud to carry forward.",
    "testimonial": "My journey at IIIT Dharwad has been transformative, fostering both personal and professional growth. I am grateful for the incredible mentors and peers who have inspired and supported me in pursuing my passions in machine learning, software development, and leadership. From rigorous academic challenges to the vibrant culture of clubs and committees, every experience has been a stepping stone toward my goals. I cherish the friendships formed, the knowledge gained, and the opportunities to lead and contribute. IIIT Dharwad is where I discovered my true potential, and I am proud to be part of such a dynamic community.",
    "graduationYear": 2025,
    "memorableExperience": "One of the most memorable parts of my time at IIIT Dharwad has been the friendships and camaraderie built through my involvement in diverse clubs and the Sports Club. Being part of the basketball team gave me both exposure and a close-knit group of friends, while participating in events through various clubs broadened my perspective and allowed me to grow alongside inspiring peers. These experiences taught me teamwork, resilience, and the value of building strong connections, making my journey here both fulfilling and unforgettable.",
    "encouragement": "To my peers and future students of IIIT Dharwad: embrace every opportunity, be it academic or extracurricular. Each experience contributes to your growth in ways that may not be immediately visible. Step out of your comfort zone, take on leadership roles, and cultivate a mindset of curiosity and persistence. Hard work and passion will open doors, and remember that IIIT Dharwad provides a strong foundation to launch you toward success. Believe in your potential, and never hesitate to seek guidance from mentors—they are invaluable resources on this journey.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/36138adc624f2c523f1c10aca832d93af46272eb-2775x4160.jpg",
    "videoUrl": null
  },
  {
    "graduationYear": 2021,
    "course": "B.Tech. in  Computer Science and Engineering",
    "testimonial": "",
    "memorableExperience": "For me, one of the most memorable experiences in college was starting a coding culture by initiating a coding club. There were multiple challenges in setting up the club due to multiple factors(Can't Mention here), so I began with a CodeChef College Chapter named 'return 0'. We organized multiple events to engage students and gradually built interest in coding. Eventually, with consistent efforts, we were able to establish it as an official coding club of the college. ",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/e589e80e7dc843353a20ee5e2a2ed02d91e43e7e-2545x3149.jpg",
    "email": "rajendra907928@gmail.com",
    "designation": "Senior Software Engineer",
    "achievements": "- Started coding club return_0 in college\n-  Presented college in SIH 2017 &18\n- Received offers from Amazon, MakeMyTrip, ShareChat in Final year and joined ShareChat \n- Currently working as a Senior Software Engineer at ProShort Inc. \n",
    "encouragement": "Hey everyone! In your early college years, focus on building strong fundamentals. While buzzwords like AI and ML are exciting, mastering core concepts like how computers work will set you apart. Strengthen problem-solving skills, as many tasks can now be handled by AI quickly. Even if you’re into AI/ML, focus on the basics and improve your math instead of diving straight into model training—it will pay off in the long run. And don’t forget to balance studies with fun!",
    "videoUrl": null,
    "_id": "JplNnnoVjWzg3lpd7aHngm",
    "name": "Rajendra Prajapat",
    "contactNo": "+91 9001162690"
  },
  {
    "encouragement": "Learn the fundamentals very well without getting distracted by the tech buzzwords these days. The good-old engineering is what is lacking in new generations as we hire in the industry these days. There is no \"one thing\" which will be constant in the era of AI so better focus on the building blocks.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/e3bdbf9f3bd58d0833666996335f5242a5f19745-500x500.jpg",
    "contactNo": "+91 9483918001",
    "designation": "Machine Learning Engineer",
    "course": "B.Tech. Electronics and Communication Engineering",
    "memorableExperience": "Coordinated the first ever tech event at IIIT Dharwad back in 2016, was a great experience.",
    "videoUrl": null,
    "_id": "JplNnnoVjWzg3lpd7auCkY",
    "name": "Sagar Raikar",
    "email": "raikarsagar007@gmail.com",
    "graduationYear": 2019,
    "achievements": "- Won hackathons conducted by Sandbox Startups, Hubli.\n- Got incubated at Sandbox startups to build next-gen drones in 2018.",
    "testimonial": "My time at Indian Institute of Information Technology Dharwad, as a part of the 2019 batch, was truly transformative. Studying Electronics and Communication Engineering, I really appreciated how the curriculum was designed to keep up with industry standards. This gave me a strong technical foundation. The focus on hands-on learning and practical applications helped me build important problem-solving skills."
  },
  {
    "email": "goelsanchit21@gmail.com",
    "designation": "Student",
    "course": "B.Tech. Computer Science and Engineering",
    "achievements": "",
    "testimonial": "IIIT Dharwad has constantly improved its performance over the years. If I look back, I wouldn't have worked as hard and received one-on-one guidance in any other institute. Students over here adapt to the challenges and overcome them, making them strong human beings and skilled experts.",
    "graduationYear": 2023,
    "memorableExperience": "It has to be my friend group and one professor in particular, Dr. Manjunath sir who helped me with a lot of opportunities. I'm in touch with these guys till now, which shows how much these people mean to me.",
    "encouragement": "I used to believe that knowledge is everything. However, learning things won't make you witty. Besides knowledge, give importance to developing problem solving skills, be it competitive programming, mathematical problems related to probability and statistics, or just brain teasers. ",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/16547a6d932f743c949a97ca3418f0f006849b03-2238x2797.jpg",
    "videoUrl": null,
    "_id": "KpeQ5C4E447AzlNZ61ZjNO",
    "name": "Sanchit Goel",
    "contactNo": "+91 61491171820"
  },
  {
    "_id": "KpeQ5C4E447AzlNZ62TQat",
    "contactNo": "+919900106080",
    "email": "aryansree2003@gmail.com",
    "graduationYear": 2025,
    "designation": "Fourth Year Student",
    "course": "B.Tech. in Data Science and Artificial Intelligence",
    "achievements": "",
    "memorableExperience": "One of my most memorable experiences at IIIT Dharwad was participating in the 48-hour hackathon, where I worked with a team to develop an adaptive learning platform for specially-abled students. The intensity of the event, combined with the thrill of solving real-world challenges under time constraints, was incredibly rewarding. The camaraderie, late-night brainstorming sessions, and eventual victory made it unforgettable, showcasing the supportive and innovative culture of our college. It reinforced my passion for using technology to make a positive social impact and deepened my appreciation for collaborative problem-solving.",
    "name": "Aryan TN",
    "testimonial": "IIIT Dharwad has provided a remarkable platform for my growth, fostering both technical skills and personal development. The curriculum’s blend of data science and artificial intelligence, coupled with practical, hands-on projects, has allowed me to apply classroom knowledge to real-world challenges. Faculty mentorship and exposure to industry events have been invaluable, connecting us with experts and enhancing our learning beyond textbooks. The collaborative environment encourages innovation, as seen through hackathons and research opportunities, where I’ve developed impactful solutions. IIIT Dharwad truly cultivates a holistic learning experience, preparing us to excel in today’s competitive tech landscape.",
    "encouragement": "To my fellow students at IIIT Dharwad, embrace every opportunity to learn and challenge yourself. The resources, guidance, and experiences available here are invaluable, so make the most of them. Push beyond your comfort zones, participate in projects, hackathons, and research—it’s these experiences that build skills and resilience. Remember, each challenge is a step towards growth, and your efforts will pay off in ways you might not yet see. Believe in your potential, and trust the process.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/f6568d0e6a1d67e21e8a920ae9865f317fb2bee4-413x531.jpg",
    "videoUrl": null
  },
  {
    "memorableExperience": "One of my most memorable experience was participating in the cultural fest, IIIT Habba. I had the opportunity to perform on stage, create art, and even manage an event, which was both exciting and transformative. These experiences helped me gain confidence, taught me teamwork, and allowed me to contribute to the vibrant campus life beyond academics.",
    "encouragement": "Keep on exploring and learning as much as you can. Learn both technical and soft skills and always keep a curious mind!",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/ea8e1c33f0b94f50a834476be991102141007e21-2390x3186.jpg",
    "_id": "KpeQ5C4E447AzlNZ62dB1O",
    "name": "Aayushi Sinha",
    "contactNo": "+917350070772",
    "email": "aayushi.sinha1980@gmail.com",
    "graduationYear": 2025,
    "designation": "Fourth Year Student",
    "videoUrl": null,
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "- Managed cultural events as Art Club President\n- Stood 1st in CSS Battles and 2nd in Web Dev Contest held by Velocity IIIT Dharwad\n- Placed at Oracle (OFSS) ",
    "testimonial": "My time at IIIT Dharwad has been truly enriching, filled with growth, friendships, and invaluable learning experiences. The supportive peers and vibrant campus culture created an environment where I could explore my interests and develop both academically and personally. Through various projects, internships, and guidance from professors, I discovered my passions and built skills that I feel confident taking into my career. Beyond academics, the college taught me resilience and adaptability, preparing me for life’s challenges. I'm grateful for the journey at IIIT Dharwad and the lasting memories I've made here"
  },
  {
    "graduationYear": 2025,
    "designation": "Fourth Year Student",
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "",
    "videoUrl": null,
    "_id": "KpeQ5C4E447AzlNZ64497t",
    "testimonial": "IIIT Dharwad has been a place of immense growth for me, providing a nurturing environment with inspiring mentors and peers who continually motivated me to excel. The collaborative culture and abundant learning opportunities have made my journey here a truly memorable one.",
    "memorableExperience": "College life was filled with unforgettable moments, from late-night study sessions to brainstorming sessions with friends. The connections made along the way made it an incredible journey.",
    "encouragement": "Stay curious, build a strong foundation in key skills, and keep pushing forward. Every step brings you closer to your goals",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/7545808fde77cedc6dae1cba5f768b55032548dc-360x360.png",
    "name": "Aditya Patil",
    "contactNo": "+917498752116",
    "email": "21bcs081@iiitdwd.ac.in"
  },
  {
    "name": "Ashish Lal",
    "email": "ashishlal2003@gmail.com",
    "graduationYear": 2025,
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "",
    "memorableExperience": "My memorable experience has been getting to know people pan India, sharing life experiences with them which truly helps improve your character.",
    "videoUrl": null,
    "_id": "KpeQ5C4E447AzlNZ645REO",
    "contactNo": "+919008779592",
    "designation": "Fourth Year Student",
    "testimonial": "IIIT Dharwad has become a place that feels complete. It’s not only focused on studies but there’s room for sports, arts, and community too. You get to learn a lot here, both in and out of the classroom, helping you grow and get ready for life in every way.",
    "encouragement": "Just don't say NO to things in your college life. Who knows, it might be the best experience for you!",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/f9537d2b34cedc99f788ea7b5abdb58260b4c9d5-1080x1920.jpg"
  },
  {
    "name": "Abhiram Koppuravuri",
    "email": "abhiramkoppuravuri@gmail.com",
    "graduationYear": 2025,
    "designation": "Fourth Year Student",
    "course": "B.Tech. in Data Science and Artificial Intelligence",
    "testimonial": "My journey at this university has been filled with challenges, but I have risen above many downfalls, thanks to the support of my exceptional peer group. The collaborative atmosphere and diverse perspectives have enriched my learning experience. With a strong sense of community and dedicated faculty, I've grown both personally and academically. I am grateful for the friendships and resilience I've gained here.",
    "memorableExperience": "My university experience has been filled with unforgettable moments spent with friends. From late-night study sessions and spontaneous game nights to watching countless anime, each memory brings a smile. I even had the chance to cosplay as Gojo Satoru and perform songs on stage for two cultural fests. These fun times, filled with laughter and support, have truly made my journey memorable and enriching!",
    "encouragement": "Embrace every challenge as an opportunity to learn and grow. Remember that setbacks are just stepping stones to success; perseverance is key. Surround yourself with supportive peers who inspire you to reach new heights. Believe in your potential, and never hesitate to pursue your passions!",
    "_id": "KpeQ5C4E447AzlNZ64gCPO",
    "contactNo": "+916304760789",
    "achievements": "",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/ccde27da39eac77b5c59a03b6ed640209969fa51-606x845.jpg",
    "videoUrl": null
  },
  {
    "encouragement": "To all the juniors at IIIT Dharwad: Embrace every opportunity that comes your way, both in academics and extracurriculars. Dive into projects and challenges with an open mind, because this is where you’ll discover your true passions. Engage actively in the vibrant campus life—attend sessions, participate in festivals, and never hesitate to ask questions or seek help. Remember, growth often comes from stepping out of your comfort zone, and these years are the perfect time to explore, innovate, and build lifelong memories. You've got an incredible journey ahead—make it count!",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/b98b9a39fd48884fc651eb4a78133650a9c4df6f-1200x1200.jpg",
    "videoUrl": null,
    "_id": "KpeQ5C4E447AzlNZ6515Vt",
    "name": "Rohit Chaudhari",
    "email": "rohitkc0109@gmail.com",
    "designation": "Final Year Student ",
    "testimonial": "My four years at IIIT Dharwad have been an extraordinary journey of growth, both academically and personally. The institute challenged me with a rigorous curriculum in Data Science and Artificial Intelligence, while also inspiring creativity and hands-on innovation. From leading the development of impactful projects like an AI chatbot and a full-stack food delivery app to organizing campus-wide sports events as the Sports Coordinator, I embraced every opportunity to learn and lead. Winning hackathons and collaborating with driven peers pushed me to think differently, and the supportive, vibrant community made every challenge exciting. These years have not only deepened my technical expertise but also instilled in me a love for teamwork, resilience, and a spirit of adventure that I will carry forward.",
    "memorableExperience": "One of the most memorable experiences during my time at IIIT Dharwad was participating in the diverse sessions and festivals hosted on campus. Engaging in these events allowed me to connect with peers, learn from experts, and celebrate the vibrant culture of our community. Whether it was insightful workshops or lively celebrations, each moment enriched my journey, leaving me with cherished memories and lasting friendships.",
    "contactNo": "+91 9326052704",
    "graduationYear": 2025,
    "course": "B.Tech. in Data Science and Artificial Intelligence",
    "achievements": ""
  },
  {
    "name": "Pranay Chennamalla",
    "designation": "Student/Web Developer",
    "course": "B.Tech Computer Science",
    "achievements": "",
    "memorableExperience": "Memorable experience would be my amazing journey for the three years under guidance of faculties . Everything about this college is memorable be it technical stuff or non technical. It's like a family here at IIIT-Dharwad. ",
    "videoUrl": null,
    "contactNo": "7995365601",
    "email": "pranay.shiva2004@gmail.com",
    "graduationYear": 2026,
    "testimonial": "IIIT Dharwad is a place where multiple opportunities can be explored as per one's interest and passion. The well knowledged faculties and the healthy competitive environment among students helps one to prosper in all domains. Our college has best of everything as per student's areas of interest . One can invest time and harvest every opportunity so as to become a diamond. Under leadership of our director sir our college has exponentially been able to diversify the existing opportunities so as to maximise the benefits for the students. IIIT-Dharwad : A Place where minds grow and prosper!",
    "encouragement": "Trust the sytsem and prosper as our college has been on a constant effort to expand the limits and boundaries in all domains for the benefit of the student community . So a simple advice would be : Follow the advice of college along with personally improving on skills required to survive the competition.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/6f1625f017134d2cb099728ce3ac606ea6411b39-576x576.jpg",
    "_id": "KpeQ5C4E447AzlNZ65D6Kt"
  },
  {
    "_id": "KpeQ5C4E447AzlNZ67ezkO",
    "name": "S Dakshish Murthy",
    "email": "dakshish.murthy2005@gmail.com",
    "graduationYear": 2026,
    "photoUrl": null,
    "contactNo": "+91 8277353053",
    "designation": "Third Year Student ",
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "\n-  leadership roles in Prabodhini, the Indian Knowledge System Club, where I organized major cultural events and initiatives. \n- The Development and Resource Team Lead for E-Cell.  \n-  Certifications in Google Cloud Computing Foundations and Generative AI, along with the internship in cybersecurity at Learnflu Ed Tech.",
    "testimonial": "My journey at IIIT Dharwad has been a transformative experience, filled with growth, learning, and memorable moments. The supportive faculty, dynamic campus environment, and dedicated peers have all contributed to my personal and professional development. IIIT Dharwad has given me the freedom to explore my passions—whether through organizing cultural events, taking on leadership roles, or advancing my technical skills. It’s a place that nurtures ambition, encourages curiosity, and fosters a genuine sense of community. I am proud to be part of an institution that has not only shaped my career but also inspired me to make a meaningful impact.",
    "memorableExperience": "My amazing journey over the past three years at IIIT Dharwad has been shaped by the guidance of our faculty and the support of my peers. Everything about this college is memorable, from the technical skills I’ve gained to the friendships I’ve built. Being involved in various events and activities has deepened my connection to our community. It truly feels like a family here, where everyone supports each other and creates lasting memories together.",
    "encouragement": "Embrace every opportunity that comes your way—whether it’s a club activity, a workshop, or a project. Growth isn’t just about grades; it’s about the lessons you learn from experiences, friendships, and challenges. “You have the right to work, but never to the fruit of work.” Build a network of support, take initiative, and remember, resilience and curiosity will take you far.",
    "videoUrl": null
  },
  {
    "contactNo": "+91 6303961494",
    "email": "saipraneethsomisetti@gmail.com",
    "achievements": " - Co-authoring a research paper on SCADA security systems, which is about to be published in an international journal. \n- This experience deepened my knowledge of critical infrastructure security and gave me valuable exposure to academic research. \n- My final year project, focusing on one-shot audio-driven talking head video generation using MRI data, was a testament to the innovative mindset fostered here at IIIT Dharwad.",
    "testimonial": "My time at IIIT Dharwad has been transformative. The first four semesters online were challenging, but stepping onto campus in the fifth semester felt like a new beginning. IIIT Dharwad’s unique approach enabled me to explore a wide array of IT fields, from AI to cloud computing and cybersecurity, rather than being limited to one stream. This comprehensive education equipped me with a skill set that has opened doors across diverse career paths.",
    "memorableExperience": "One of my most cherished memories at IIIT Dharwad was during our annual 'IIITDWD Habba,' particularly Habba 2.0, which brought the campus to life with events spanning singing, dancing, skits, dramas, and even treasure hunts. Being a Carnatic vocalist and a member of the music club, I had the chance to perform alongside incredibly talented musicians, whose passion and skills left a lasting impression on me. Our college embraced all Indian festivals with enthusiasm, and with friends from nearly every state, I had the unique experience of seeing how traditions vary across India. Each celebration became a cultural exchange, allowing us to learn about and appreciate different customs, enriching our friendships and building a sense of unity within our diverse student body.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/dc808e7c8b4a0c0bee69529ce0cae0978d06f4e4-1080x1770.png",
    "videoUrl": null,
    "_id": "KpeQ5C4E447AzlNZ6Cngjt",
    "graduationYear": 2023,
    "designation": "Associate Analyst",
    "course": "B.Tech. in Computer Science and Engineering",
    "encouragement": "Embrace every opportunity to learn across disciplines, as it will ultimately shape your career in ways you can’t foresee. Remember, the connections and experiences you gain are as valuable as the technical skills.",
    "name": "Somisetty Sai Praneeth"
  },
  {
    "testimonial": "My journey at IIIT Dharwad has been transformative, both professionally and personally. The rigorous curriculum and hands-on projects have built a strong foundation in computer science and given me the technical expertise needed to excel in the industry. Beyond academics, IIIT Dharwad fostered a spirit of innovation and collaboration, inspiring me to push boundaries and explore cutting-edge technologies. Working on projects like a high-accuracy real-time location-sharing app and a credit card fraud detection system honed my skills in practical problem-solving and teamwork.  The supportive faculty and the vibrant campus environment encouraged me to take on challenges that have shaped my career aspirations. Additionally, the friendships and connections I formed here have enriched my journey, giving me invaluable experiences that will stay with me. IIIT Dharwad has been instrumental in helping me grow into a well-rounded individual ready to take my career to new heights.",
    "memorableExperience": "",
    "name": "Shubh Bindal",
    "contactNo": "+918279824210",
    "email": "shubhagrawal74824@gmail.com",
    "graduationYear": 2024,
    "designation": "Systems Enginner",
    "encouragement": "To all the current students at IIIT Dharwad, embrace every moment of your journey here—it’s an incredible time to learn, grow, and define your path. Don’t shy away from challenges; they are stepping stones to personal and professional growth. Get involved in projects, work with peers, and explore as much as you can; these experiences build your confidence and make you industry-ready.\r\n\r\nRemember, it’s okay not to have everything figured out. Be persistent, keep pushing boundaries, and stay curious. Cultivate a balance between learning, experimenting, and enjoying this time. The knowledge, friendships, and resilience you build here will shape your future. Believe in yourself, and remember that every effort you put in today is an investment in your dreams. You’ve got this!",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/4dfc0db8733883edc4db86e792e4e72702e0525d-784x784.jpg",
    "videoUrl": null,
    "_id": "KpeQ5C4E447AzlNZ6CodAO",
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": ""
  },
  {
    "name": "Saharsh Kumar",
    "contactNo": "+91 6287279304",
    "email": "slygrin005@gmail.com",
    "graduationYear": 2026,
    "designation": "Third Year Student ",
    "course": " B.Tech. in  Electronics and communication Engineering",
    "memorableExperience": "One of the most unforgettable moments of my career occurred when I was playing as the last batsman in sports and 4 runs needed of 1 ball and I luckily hit 6 in that ball.",
    "encouragement": "To anyone reading this, I encourage you to view challenges as chances for growth. Success isn’t always about taking the easiest path, but about learning from every experience—whether it's a win or a setback.",
    "_id": "KpeQ5C4E447AzlNZ6DXnUt",
    "achievements": "Through consistent effort and determination, I’ve reached significant milestones in both my personal and professional growth. I am a FSD intern in Innomatics Research Labs build scalable projects and with great team coordination and communication.",
    "testimonial": "I am deeply thankful for the opportunities and experiences that have helped shape my journey. The ongoing support from mentors, colleagues, and friends has played a crucial role in my development.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/c21a24cd8cd66ac937062e35db215aabfcc247d4-465x492.jpg",
    "videoUrl": null
  },
  {
    "_id": "KpeQ5C4E447AzlNZ6DsFxt",
    "name": "G Rama Krishna Reddy",
    "contactNo": "+919398093268",
    "email": "reddyrk31@gmail.com",
    "course": "B.Tech. in Electronics and Communication Engineering",
    "testimonial": "IIIT Dharwad  provided a balanced experience rigorous academic guidance and personal development. The faculty support has been invaluable in helping me shine through in various projects. The focus on sports and extracurricular activities promoted teamwork and resilience in me, making my college years truly enriching.",
    "memorableExperience": "Playing badminton in college was one of my most unforgettable experiences. I pushed myself through every game, driven by passion and the thrill of competition. However, an unexpected injury  forcing me to stop. While disappointing, it taught me resilience and the importance of sportsmanship. This experience remains a cherished memory, reminding me of the dedication and spirit sports instilled in me.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/b28f84c95ee6a0ce6fe095be44c3b01cc56cd5b6-2316x3088.jpg",
    "graduationYear": 2025,
    "designation": "Fourth Year Student",
    "achievements": "Founded great Friends ",
    "encouragement": "Get involved in projects, make use of the faculty's guidance, and don’t shy away from challenges—they’ll only make you stronger. Whether it’s academics, sports, or friendships, this journey will shape you in ways you never expected. Enjoy it, stay curious, and make the most of these years.",
    "videoUrl": null
  },
  {
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/a8357a59654c8d4b00d7c01966cf1d5e7155a8a3-1175x1200.png",
    "videoUrl": null,
    "name": "ROHIT SAGAR SHINDE",
    "email": "rohitshinde180301@gmail.com",
    "graduationYear": 2023,
    "achievements": "- Received a PPO from Amazon.\n- Gold medal in Cricket Tournament at IIIT Dharwad Intra Sport Event 2022 (Team Captain).\n- Silver medal in Javelin Throw at IIIT Dharwad Intra Sport Event 2022.\n- Silver medal in Discus Throw at IIIT Dharwad Intra Sport Event 2022.",
    "testimonial": "Hello everyone, I want to take a moment to reflect on my journey in the tech world. It all began with an internship at Amazon, where I had the opportunity to work with an amazing team and tackle challenging projects. Thanks to that experience, I was honored to receive a pre-placement offer a year later from Amazon. Currently I’m working as a Software Engineer at Microsoft. This journey has taught me the importance of hard work, continuous learning, and embracing challenges. ",
    "encouragement": "Believe in your potential and never shy away from challenges. Each step you take, no matter how small, is a step toward your goals. Embrace learning opportunities and don’t hesitate to seek help when needed.",
    "_id": "Lm0DTotabiNqdmvjOSTEgu",
    "contactNo": "+91 7057847283",
    "designation": "Software Engineer",
    "course": "B.Tech. in Computer Science and Engineering",
    "memorableExperience": "Serving as the sports coordinator for the sports club at IIIT Dharwad was a great experience. I cherished bringing everyone together for fun events and building lasting friendships along the way."
  },
  {
    "memorableExperience": "A memorable experience for me was winning 2nd prize at Hack2Future. I was so exhausted during the prize distribution that I went back to my room to rest. Suddenly, a friend called to say we had won! I rushed to M-Block, excited and in disbelief, to collect the prize.",
    "encouragement": "If you’re into web or app development, start building real projects! Courses teach you concepts, but the real learning happens when you apply them. Every bug is a chance to learn, and every project is a step forward. Keep experimenting, stay curious, and enjoy the journey. You've got this! 🚀",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/13900dd72812acefbd5d90c21bf7105e49aa0df6-1545x1545.jpg",
    "videoUrl": null,
    "email": "mandardighe6@gmail.com",
    "designation": "Fourth Year Student",
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "- Runner up in Hack2Future a national-level hackathon organized by IIIT Dharwad.",
    "testimonial": "I am incredibly grateful for my time at IIIT Dharwad. Through hands-on projects, hackathons, and engaging extracurricular activities, I gained invaluable experience and developed skills that will serve me well in my career. I’ll always remember the friendships I made and the lessons I learned here in this college.",
    "_id": "Lm0DTotabiNqdmvjOWJ82R",
    "name": "Mandar Dighe",
    "contactNo": "+918625058021",
    "graduationYear": 2025
  },
  {
    "memorableExperience": "Staying up all night to study, going directly to the exam without any sleep, and then falling asleep while taking the exam is unforgettable.",
    "videoUrl": null,
    "_id": "Lm0DTotabiNqdmvjOZOrZI",
    "name": "Harshit Mishra",
    "contactNo": "+917424821651",
    "designation": "Specialist Programmer",
    "achievements": "-Hackcbs 6.0 winner",
    "testimonial": "The faculty at college are incredibly knowledgeable and genuinely invested in student success. They make learning engaging and are always available for guidance and support. Their commitment has made my experience here both enriching and inspiring.",
    "encouragement": "Don't forgot to add smart work to your hard work.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/569364859461c26fbfdcf70c31e4f839ded426ef-4000x3000.jpg",
    "email": "harshitmishra655@gmail.com",
    "graduationYear": 2024,
    "course": "B.Tech. in Electronics and Communication Engineering"
  },
  {
    "name": "Jaishana Bindhu Priya",
    "email": "jaishana25@gmail.com",
    "designation": "Fourth Year Student",
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "- Organised First National Level Hackathon at IIIT Dharwad\n- Hackathon 2nd Prize Winner at Smart Agrothon\n- Lead of Google Developer Students Club\n- Bagged roles as intern at Bosch, IBM, IISc \n- Google Girl Hackathon top 2.5%\n- UIEO AIR 26\n- CBSE National Top 1% (499/500)",
    "testimonial": "At IIIT Dharwad, the dedicated faculty members, create a supportive learning environment that goes beyond academics. The vibrant campus fosters personal growth, and the active clubs helped me develop leadership skills and teamwork. This holistic approach truly prepares students for life beyond the classroom. I highly recommend IIIT Dharwad for anyone seeking a well-rounded college experience.\r\n",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/e93ab6c004a70209f1e559cc0bcc0db588ecd8cf-1154x1398.png",
    "contactNo": "+918870040108",
    "graduationYear": 2025,
    "memorableExperience": "I had a really memorable time the last 6 months planning for the college hackathon along with students of other technical clubs.. Almost every day at IIIT Dharwad is memorable in its own way, filled with new experiences and opportunities that have shaped my journey.",
    "encouragement": "I highly recommend IIIT Dharwad for its welcoming atmosphere and strong support for students. The faculty genuinely care about your success and are always there to help. With a wide range of activities and a diverse community, you’ll find plenty of ways to explore your interests and make lasting friendships. It’s a great place to learn and grow.",
    "videoUrl": null,
    "_id": "Lm0DTotabiNqdmvjOcHKzW"
  },
  {
    "contactNo": "+91 9987995934",
    "email": "saahilvishwakarma02@gmail.com",
    "graduationYear": 2026,
    "designation": "Third Year Student",
    "course": "B.Tech. in Computer Science and Engineering",
    "testimonial": "\r\nDuring my time at IIIT Dharwad, I have grown both academically and personally. My commitment to maintaining a strong CGPA reflects my dedication and hard work, and my journey here has been one of constant learning and self-improvement. I’m grateful for the support of my professors and peers, who have made this experience memorable and meaningful. As I look forward to new challenges, I carry with me the knowledge, resilience, and values that IIITDWD has instilled in me.",
    "memorableExperience": "\r\nMy time at IIIT Dharwad has been nothing short of transformative. The vibrant campus life, supportive professors, and passionate peers have shaped my learning journey in profound ways. Every moment has added to a treasure of experiences. The blend of knowledge, friendships, and unforgettable memories will forever hold a special place in my heart.",
    "encouragement": "To all my juniors at IIIT Dharwad: make the most of every opportunity that comes your way! Focus on building a strong foundation in your academics, but don’t hesitate to explore projects, internships, and self-learning to broaden your skills. Remember, growth happens outside your comfort zone—take part in new experiences, connect with your peers, and don’t fear failure. Every step, big or small, contributes to your journey. Believe in yourself, work hard, and enjoy every moment. Your potential here is limitless!",
    "_id": "MLhmtgZT0AdNp6YQvMxVq9",
    "name": "Saahil. A. Vishwakarma",
    "achievements": "One of my key achievements at IIIT Dharwad has been maintaining a strong academic record with a CGPA of over 7. Throughout my studies, I focused on deepening my understanding of core subjects and developing my technical skills. My dedication to coursework and continuous learning has allowed me to build a solid foundation in my field, preparing me well for future challenges.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/9fb8aa9d862bd051b45e73becc0b6e551cd769be-1253x1319.jpg",
    "videoUrl": null
  },
  {
    "name": "Chirag Mittal",
    "contactNo": "+918527288876",
    "graduationYear": 2024,
    "achievements": "Learnt engineering from the college itself, started doing internships, participated and won in hackathons, got research fellowship.  ",
    "testimonial": "Good place to learn, Faculties are really supportive. Project based learning approach helps learn fast.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/dbc4e0c9fff14d8d28293771452acc20b6200a97-3024x4032.jpg",
    "_id": "RDE4gq5mPS2SGXlBltsqoE",
    "email": "chirag35847@gmail.com",
    "designation": "Software Development Engineer",
    "course": " B.Tech. in Data Science and Artificial Intelligence",
    "memorableExperience": "All nighters during hackathons, Mid and end sem preperation. Running to morning class just 2 mins before. Had really fun and amazing time with batchmates.",
    "encouragement": "Always keep learning, you never know when its gonna help. I've read research papers on specific products of AWS and fortunately that helped me in an interview the other day. Stay curious, keep learning and keep growing.",
    "videoUrl": null
  },
  {
    "name": "Prajwal M N",
    "email": "prajwalmn5092@gmail.com",
    "course": "B.Tech. in Electronics and Communication Engineering",
    "achievements": "- Founded HarleyGrow which has raised $4000 by the Government of India. We are listed in one of the 5000 startups of India in the Msh Portal.",
    "memorableExperience": "My First Startup at the age of 20. Incubating my Startup at KLE- CTIE and listing it in the website.",
    "encouragement": "Entrepreneurship is a something which requires a lot of hard days . take it has a runway once your get enough speed you will fly.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/6bec927648414dc4fac7fe44f62a18ab42eda40b-1425x2235.jpg",
    "videoUrl": null,
    "_id": "STFtXRxAKdfeO2BkeRPmak",
    "contactNo": "+917892338411",
    "graduationYear": 2025,
    "designation": "Fourth Year Student",
    "testimonial": "The college has suported me in providing workSpace and other requirements when in need. Always Gratefull for being here. Spending time with Brilliant minds."
  },
  {
    "_id": "STFtXRxAKdfeO2BkeXCFuZ",
    "name": "Enduri Jahnavi",
    "contactNo": "+917013714146",
    "email": "jahnavienduri@gmail.com",
    "graduationYear": 2025,
    "course": "B.Tech. in Data Science and Artificial Intelligence",
    "achievements": "-  ⁠Runner-up at Hack2Future National Hackathon\n- ⁠ Secured Global Ranks 5th, 3rd, and 3rd for respective tasks at SemEval-2024.\n- ⁠ Hands on Experience as  SWE ML Intern at Think7, and as an AI Engineering Intern at Vocab.AI.\n-  ⁠Published research papers at SemEval-2024 and in Disability and Rehabilitation: Assistive Technology IIDT.\n- ⁠Served as AI/ML Lead for GDSC IIIT Dharwad Chapter, President of E-Cell and Cultural Committee Student Body Head, driving innovation and collaboration among students.",
    "encouragement": "To all the juniors, dive into every opportunity you get! Take on projects that challenge you, and don’t be afraid to reach out for help—it’s all part of the learning journey. Build connections and work together; collaboration and hands-on experience will be some of your biggest assets here.",
    "designation": "Fourth Year Student",
    "testimonial": "The project-based approach at IIIT Dharwad for every course really gives us the chance to dive into current trends and technologies, letting us explore and experiment in a hands-on way. This is where the real learning happens. The faculty also make sure the curriculum stays up-to-date with the tech world, and they’re always there to guide and support us through each step.",
    "memorableExperience": "Debugging errors is a common part of our journey. It can be overwhelming at times, but what I love is how we tackle these challenges. We identify the source of the problems and work through solutions as a group. This process not only strengthens our bond as teammates but also puts our problem-solving skills into action, turning frustrating moments into opportunities for growth and collaboration.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/65cb6fba7781d01b7a7cd2ed7ccc4d4b7b392d3c-500x400.png",
    "videoUrl": null
  },
  {
    "name": "Gourab Chakraborty",
    "email": "evenprime777@gmail.com",
    "graduationYear": 2023,
    "designation": "Software Developer",
    "testimonial": "I have seen the college go from no campus and a weak developer culture to a well equipped campus with modern infrastructure and strong engineering base in a short period of 4 years. The 2024 and 2025 batches are absolutely top notch and at par with all the leading Indian institutions thanks to dedicated faculties like Dr Manjunath K V, Dr Sunil Saumya, and many more. One gains immense technical prowess and international exposure thanks to the national and international contributions the students make at IIIT Dharwad via open source, hackathons and other tech competitions. This is evident in the individual and team achievements the students of the 2024 and 2025 batches have been making lately.",
    "memorableExperience": "I have several memorable experiences but they all have one thing in common: working in a team solving cutting edge technical problems.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/8a3674903b76ceda5359ecb8cbdc39a33b3738af-2159x1940.jpg",
    "_id": "SW7FIhGl6eig7Pnek89bs4",
    "contactNo": "+917540015753",
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "- Google Summer of Code 2021\n- ETHIndia 2022 ",
    "encouragement": "All the best for your future endeavours! Be it masters or joining the corporate, I hope you all maintain the same energy that you had in college and I’m sure you’ll be successful in them too. I would also like to thank the faculties at IIIT Dharwad who give so much to the students every day but aren’t appreciated enough! Without your efforts, we wouldn’t be where we are today.",
    "videoUrl": null
  },
  {
    "memorableExperience": "I had a great time with friends and created wonderful memories.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/7a21572539e6884fc0af78516887297d914487a9-4896x6528.jpg",
    "videoUrl": null,
    "name": "Kushwanth Bandanadham",
    "email": "kushwanth2922@gmail.com",
    "designation": "Masters in computer engineering at NCSU",
    "testimonial": "The professors in the ECE department are supportive in every aspect. I would like to thank Deepak Sir, Jagadish R. Bhat Sir, Mukesh Sir, Chinmaynanda Sir, and Prakash Pawar Sir for their assistance at IIIT Dharwad.",
    "encouragement": "Make an effort to travel more and explore new experiences instead of staying in your room and being inactive. Create memories with friends and maintain a good physique.",
    "_id": "SW7FIhGl6eig7PnekA2Ldr",
    "contactNo": "+917995733379",
    "graduationYear": 2024,
    "course": "B.Tech. in Electronics and Communication Engineering",
    "achievements": ""
  },
  {
    "_id": "SW7FIhGl6eig7PnekCQsW7",
    "email": "udayinivedantham@gmail.com",
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "",
    "encouragement": "Make connections with as many professors and seniors as possible",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/3b74681f0541358d05c2723a6da90ee6b30990a1-2633x3500.jpg",
    "videoUrl": null,
    "name": "Udayini Vedantham",
    "contactNo": "+91 6360385966",
    "graduationYear": 2025,
    "designation": "Fourth Year Student",
    "testimonial": "Along with IIIT Dharwad growing a lot from since i was a fresher, I, myself also grew with it, getting exposure in different fields.",
    "memorableExperience": "My memorial experience would be from the Cultural events conducted, when all the students come together and dance the night away."
  },
  {
    "email": "jyothirmaisuravarapu@gmail.com",
    "designation": "Final Year Student",
    "course": "B.Tech. Computer Science and Engineering",
    "achievements": "- AWS AI/ML Scholarship Recipient (2x)\n- Awarded the AWS AI/ML Scholarship twice, a recognition of dedication and excellence in advancing skills in artificial intelligence and machine learning.\n",
    "testimonial": "My college has provided a solid foundation in computer science and encouraged hands-on learning through labs and projects. The faculty is supportive, and the curriculum emphasizes practical applications, which has helped me gain experience in AI, machine learning, and cloud computing. Overall, it’s been a great environment for building both technical and problem-solving skills",
    "videoUrl": null,
    "contactNo": "+91 9515193555",
    "graduationYear": 2025,
    "memorableExperience": "Hanging out and working with my friends and our late night study sessions just before an exam and encouraging each other to hang on there.",
    "encouragement": "Enjoy the journey, and don’t be afraid to dive into new challenges! Take advantage of every opportunity to learn, whether it’s through projects, internships, or simply experimenting with new technologies. Stay curious, and remember that persistence is key—some of the best lessons come from overcoming obstacles. Build a strong foundation, but also follow your interests and explore areas you’re passionate about. And most importantly, don’t hesitate to reach out for help; your peers and professors are here to support you. You’ve got this—make the most of your time here!",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/c6ccca483328270867ab371f50e088b7540b8555-3024x4032.jpg",
    "_id": "SW7FIhGl6eig7PnekD3iF0",
    "name": "Sai Jyothirmai Suravarapu"
  },
  {
    "memorableExperience": "The highlights of our college life were the vibrant cultural fests, thrilling hackathons, and exhilarating sports events that created lasting memories.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/98434609e6181b9a1956079ade8b8dec3b2c2110-800x800.jpg",
    "videoUrl": null,
    "_id": "SW7FIhGl6eig7PnekD8iKy",
    "name": "Siddhant Sudesh Chalke",
    "contactNo": "+91 9860906463",
    "email": "siddhant.chalke13@gmail.com",
    "designation": "Fourth Year Student",
    "course": "B.Tech. in Computer Science and Engineering",
    "testimonial": "As the first batch (2021-2025) to move into the new permanent campus, we've had the unique privilege of witnessing the institute's remarkable growth and evolution firsthand. The campus has developed before our eyes, with a faculty that’s particularly outstanding in fields like ML/DL, Cybersecurity, Quantum Computing, Cloud Computing, etc. The college’s coding culture has flourished, especially in competitive programming, driven by dedicated clubs like Return 0, which have nurtured and developed a community of exceptional problem solvers and coders.",
    "encouragement": "Live by the LEAP Approach: Learn, Engage, Apply, and Persevere. Learn as much as you can from every opportunity, engage actively with your peers and mentors, apply your knowledge in real projects, and persevere even when things get tough. Each step brings you closer to becoming the best version of yourself, so keep leaping forward!",
    "graduationYear": 2025,
    "achievements": "- HackWithInfy 2024 2nd Runner Up\n- SDE Intern - AI (Summer 2024), Mphasis NEXT Labs"
  },
  {
    "videoUrl": null,
    "_id": "SW7FIhGl6eig7PnekDAkBh",
    "name": "Jahnavi Hegde",
    "contactNo": "+919353120732",
    "email": "jahnavihegde2019@gmail.com",
    "graduationYear": 2025,
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "-Selected for the prestigious Summer Research Internship Program (SRIP) at IIIT Bangalore which focused on areas like multi-party computation (MPC) and homomorphic encryption.\n-Co-authored a paper on diabetes management using continuous glucose monitoring (CGM) devices which is currently under review.\n-Selected for Udacity AWS AI & ML Scholarship.\n",
    "memorableExperience": "I have had many experiences over the course of my studies here at IIIT Dharwad, from late-night chit-chats with friends to vivas and last-minute library runs. Whether it was getting ready for events or outings or pulling all-nighters for exams, each moment was filled with laughter and camaraderie. All of these unforgettable experiences will always live on in my heart.",
    "designation": "Fourth Year Student",
    "testimonial": "IIIT Dharwad has played a pivotal role in my growth and has shaped me into the person I am today. The supportive community of professors and peers has equipped me with the social and technical skills essential for my career. The hands-on learning approach and diverse opportunities have not only enhanced my technical expertise but also fostered my personal development. The close-knit culture and vibrant campus life have made my journey here truly unforgettable, and I am grateful for the lifelong connections and invaluable knowledge I've gained.",
    "encouragement": "To my juniors, I want to remind you that your time here goes by too fast. Embrace every moment, take advantage of the opportunities around you, and make lasting memories. Don’t hesitate to explore new ideas and forge connections, as these experiences will shape your journey in ways you can’t yet imagine. Make the most of your time at IIIT Dharwad, and remember to take breaks when you need them! :)",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/0d97af33682076eb3e26cc77cf127ae34581861e-1200x1600.jpg"
  },
  {
    "email": "aashishkhandelwal1570@gmail.com",
    "achievements": "",
    "memorableExperience": "The list is infinitesimally large, but I can add that despite having backlogs due to my health issues in my 1 and 2 semesters, I always pushed myself to conquer all my breakers.",
    "encouragement": "Welcome here ! I encourage you people to join IIIT Dharwad if you want to be a hardworking and managing personality in life.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/08a9b3ef4e6fb995cf5460142d3c9f95db453f05-1121x1221.png",
    "videoUrl": null,
    "contactNo": "+919870687299",
    "graduationYear": 2026,
    "designation": "Third Year Student",
    "course": "B.Tech. in Electronics and Communication Engineering",
    "testimonial": "Aashish Saini - As a part of IIIT Dharwad, I will always be cherishing the time that I've spent here and fostering the experience that I gained. Being a part of tough and challenging academics, I've seen lots of ups and down which moulded me into a shape of hardworking and managing personality. I'm extremely grateful that I got to live some of my life moments here and gained infinitely valuable insights from the community. I've started my journey with tech but now I'm heading towards management and that's the culture which always pushes you to go beyond your limited and unseen qualities. Thanks to IIIT Dharwad for providing such a great and challenging workspace.",
    "_id": "SW7FIhGl6eig7PnekDoBuU",
    "name": "Aashish Saini"
  },
  {
    "graduationYear": 2027,
    "designation": "Second Year Student",
    "course": "B.Tech. in Data Science and Artificial Intelligence",
    "achievements": "- Research Intern at IIT Dharwad during summer, 2024. I have secured NTSE state rank 6 in the year 2021",
    "testimonial": "IIIT Dharwad is rapidly growing Institute. The project- based approach of courses provides industry like practice. The dedicated faculty members create a supportive learning environment.",
    "encouragement": "Welcome to an incredible journey of learning, growth, and unforgettable experiences. The supportive faculty is deeply invested in each student's progress. The director sir is supportive and creating new ways for progress of IIIT Dharwad. ",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/4ac7836860d80bda4f3919b1528537a992c6b024-605x806.jpg",
    "videoUrl": null,
    "_id": "SW7FIhGl6eig7PnekE6qaJ",
    "name": "Manikesh Kumar",
    "contactNo": "+918500900841",
    "email": "23bds032@iiitdwd.ac.in",
    "memorableExperience": "Almost every day at IIIT campus is memorable, from new learning to implementing it in problems"
  },
  {
    "contactNo": "+917025206696",
    "email": "parvati.jayakumar.29@gmail.com",
    "achievements": "",
    "testimonial": "My college journey was profoundly shaped by the mentorship and expertise of our professors. Their dedication went beyond textbooks and to the real-world applications. Their unwavering support and insights have been instrumental in shaping both my academic and personal growth. Also, the support of my peers pushed me to grow, making each challenge rewarding and every success more meaningful.",
    "videoUrl": null,
    "_id": "SW7FIhGl6eig7PnekGCzCD",
    "name": "Parvati Jayakumar",
    "graduationYear": 2022,
    "designation": "Alumni ",
    "course": "B.Tech. in Electronics and Communication Engineering",
    "memorableExperience": "COVID hit during my first year, so after two years of remote learning, returning to a brand-new campus was surreal. Stepping onto the grounds with friends, seeing the incredible infrastructure, and finally experiencing college life in person made it all feel worth the wait. That was one of the most memorable experiences of my college life.",
    "encouragement": "Believe in yourself and keep working hard, even when results aren’t immediate. Trust that every effort counts, and when the time is right, things will fall into place. Stay consistent, and success will come!",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/e6d54d46a93f7d0f65c9247c36626fd1783dfe6c-1076x922.jpg"
  },
  {
    "designation": "Fourth Year Student",
    "testimonial": "My experience at IIIT Dharwad has been transformative. The hands-on learning, coupled with guidance from expert faculty, has helped me build a solid foundation in Electronics and Communication Engineering. The opportunities for projects and research have prepared me to face real-world challenges confidently. IIIT Dharwad is where innovation meets excellence.",
    "memorableExperience": "One of my most memorable experiences was learning the basics of ROS and Drone Systems from a boot camp. It was an interesting workshop which expanded my knowledge of UAVs and their functioning.",
    "encouragement": "Enjoy your time at the Campus to the fullest.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/79cd44d160150fa7976617449aabcfbdc012c12a-4000x4000.jpg",
    "videoUrl": null,
    "name": "Bhanu Sameer",
    "contactNo": "+918790362468",
    "email": "bunnydps@gmail.com",
    "graduationYear": 2025,
    "course": "B.Tech. in Electronics and Communications Engineering",
    "achievements": "",
    "_id": "SW7FIhGl6eig7PnekGlPTa"
  },
  {
    "graduationYear": 2027,
    "designation": "Second Year Student",
    "course": "B.Tech. in Computer Science and Engineering",
    "testimonial": "IIIT dharwad is a excellent college  where all Professor is fabulous in teaching explain very well and its infrastructure , Canteen , Mess and nice hostels and this college located in a very quiet place that makes feel very charming ",
    "memorableExperience": "Since I began my journey at this college, I have witnessed numerous improvements that enhance the campus ecosystem. The addition of a small walking park and the organization of enjoyable festivals are just a couple of the elements that make this college truly special.",
    "encouragement": "we encourage our junior to do something great for your family and this college to believe and make this country proud and  be focused on study ",
    "_id": "SW7FIhGl6eig7PnekGooEB",
    "name": "Alok Kumar Das",
    "contactNo": "+919835137229",
    "email": "alokhacs222729@gmail.com",
    "achievements": "",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/69e5ea826bc34ec4ab3cdee927a4986d8f128c89-1238x1600.jpg",
    "videoUrl": null
  },
  {
    "designation": "Fourth Year Student",
    "memorableExperience": "Being part of club activities and organizing little events. ",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/330431e7f1cb80c42bdc43ba89df3caf0bc525ff-800x800.jpg",
    "videoUrl": null,
    "_id": "SW7FIhGl6eig7PnekH4LxX",
    "contactNo": "+91 7276814898",
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "- Runner up at Hack2Future hackathon",
    "testimonial": "The college has brilliant infrastructure and an encouraging community with dedicated faculty. The college has nurtured my curiosity and helped with understand my interests more deeply. Following the current lines of progression, I can definitely see the institute helping many more students like me achieve unprecedented heights.",
    "encouragement": "Do your best!",
    "name": "Smruti Milind Patil",
    "email": "patilsmruti248@gmail.com",
    "graduationYear": 2025
  },
  {
    "course": "B.Tech. in Data Science and Artificial Intelligence",
    "achievements": "- Published a research paper at MDPI Sensors 2024\n- Top 10 finalist at HackFest NITTE\n- Secured internships at Infosys Springboard, IIT Madras & IIIT Sri City\n- Integrated deep learning & Generative AI workloads on my Intel Iris Xe GPU and reduced computational cost for lung tumor segmentation by 99%.\n",
    "testimonial": "IIIT Dharwad has been a pivotal part of my academic journey. The blend of rigorous coursework and supportive faculty has fostered a deep understanding of technology. The hands-on learning experiences and collaborative environment have prepared me well for real-world challenges. I’m proud to be a part of this innovative community!",
    "memorableExperience": "Some of my most memorable college experiences include late-night study sessions with friends, where laughter and coffee fueled our attempts to tackle challenging projects. I’ll never forget the excitement of participating in hackathons, collaborating with diverse teams to create innovative solutions under pressure. Attending inspiring guest lectures opened my eyes to new ideas and career paths, while spontaneous adventures, like impromptu road trips, deepened friendships in ways I never anticipated. Each moment, whether academic or social, contributed to a rich tapestry of growth and discovery.",
    "encouragement": "Bravely Second, the courage to try again! Embrace failure as part of the journey. Every setback is not a defeat but a lesson that propels us forward. When the path gets tough, remember that resilience is born from struggle. Each time you rise, you grow stronger, more determined, and closer to your goals. Never let fear of failure hold you back—keep pushing, keep trying, and let your courage light the way.",
    "contactNo": "+91 8106351468",
    "graduationYear": 2025,
    "designation": "Fourth Year Student",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/2f2abca6b0bd2b1a6469d3cb8989e6786846c84d-520x720.jpg",
    "videoUrl": null,
    "_id": "SW7FIhGl6eig7PnekHTG7n",
    "name": "Sharan Thummagunti",
    "email": "tsharan76@gmail.com"
  },
  {
    "testimonial": "My time at IIIT Dharwad has been transformative, thanks to its exceptional infrastructure and supportive peer group. The enriching environment helped me grow both academically and personally. Leading and working with clubs further honed my skills, fostering a sense of responsibility and teamwork that will stay with me beyond college.",
    "encouragement": "My advice to juniors is to explore various technologies and career pathways to discover what truly excites you. Embrace this journey of learning and growth, and don’t forget to enjoy every moment of college life, it’s a time you’ll cherish forever!",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/a3cf09666a0a6d97f4b5fe2673cebf4ef55178e3-2146x2564.jpg",
    "_id": "SW7FIhGl6eig7PnekLVlRX",
    "name": "Aayush Kumar",
    "email": "2301aayush@gmail.com",
    "achievements": "- I have achieved success in three hackathons, winning the Cricket Code Champions Hack on HackerEarth, HackChess and SandCodes on Devpost. \n- Additionally, I secured a top 10 position in Hack2Future, the inaugural national-level hackathon hosted by IIIT Dharwad.",
    "memorableExperience": "My most memorable experiences at IIIT Dharwad are the countless moments spent with friends whether in class, in the hostel, or playing together. These memories, filled with laughter and joy, will stay with me for a lifetime.",
    "videoUrl": null,
    "contactNo": "+917352629192",
    "graduationYear": 2025,
    "designation": "Fourth Year Student",
    "course": "B.Tech. in Computer Science and Engineering"
  },
  {
    "course": "B.Tech. in Data Science and Artificial Intelligence",
    "achievements": "- Published a manuscript in the MDPI Sensors journal. \n- Cleared GATE 2024 (Both DA and CS) in my 3rd year.",
    "testimonial": "IIIT Dharwad has been an excellent experience that taught me the value of teamwork and overcoming my fears.",
    "videoUrl": null,
    "_id": "SW7FIhGl6eig7PnekZZ1E8",
    "email": "aayushipadia1210@gmail.com",
    "memorableExperience": "Memorable experience would be engaging with my knowledgeable peers and mentors who have guided me to become a better version of myself.",
    "encouragement": "Face all your fears while you're in this college because you won't get such a chance again in life. Please make the most of it and always strive to be better.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/6c1df7ce16b27210a675369c579fa610e369ea70-1200x1600.jpg",
    "name": "Aayushi Jagdishbhai Padia",
    "contactNo": "+919265334142",
    "graduationYear": 2025,
    "designation": "Fourth Year Student"
  },
  {
    "encouragement": "No success is going to come easy to you. You are going to doubt yourself multiple times and question if what you are doing is right. But the key here is not giving up. Even if you send out 100 cold emails and receive no replies, remember that a few responses can lead to valuable opportunities. The crucial part is to keep pushing forward and never give up.",
    "videoUrl": null,
    "name": "Nupur Sangwai",
    "contactNo": "+91 7620588298",
    "email": "nupursangwai@gmail.com",
    "designation": "Fourth Year Student",
    "course": "B.Tech. in Data Science and Artificial Intelligence",
    "achievements": "- Research Intern at DRDO YSL-AI, Bangalore. \n- Research Intern at IIT Guwahati. \n- Selected for Amazon ML Summer School 2024. \n- AIR 1463 in GATE DA 2024. \n- Represented my college in the Inter IIIT sports competition for Basketball and Table Tennis.",
    "memorableExperience": "My most memorable experiences at IIIT Dharwad have been serving on the cultural committee and organizing successful events alongside friends and juniors. The atmosphere during these fests is so vibrant, and I truly love being part of it.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/a4c2da6d60bb23098d513ff3ca38d2ab5143c92c-2656x3984.jpg",
    "_id": "SW7FIhGl6eig7PnekZe0OK",
    "graduationYear": 2025,
    "testimonial": "The comprehensive course design, along with supportive faculty and a vibrant peer network, has fostered my growth in countless ways at IIIT Dharwad. The innovative atmosphere here motivates us to pursue our career paths with passion and determination. Beyond academics, the college promotes growth in sports and cultural activities, ensuring a well-rounded experience that prepares us for the future."
  },
  {
    "graduationYear": 2022,
    "designation": " Assistant Product Manager",
    "testimonial": "IIIT Dharwad has been an incredible place to grow both academically and professionally. The college has made significant improvements in placements, with companies from diverse industries offering excellent opportunities. The competitive yet collaborative culture among peers motivates you to push your limits, and the supportive faculty members ensure a strong foundation for success. The atmosphere here fosters growth, innovation, and a drive for excellence.",
    "memorableExperience": "One of my most memorable experiences was collaborating with my classmates on various projects and hackathons, where we worked together to build solutions to real-world problems. The late-night brainstorming sessions, shared laughs, and hard work made these experiences truly unforgettable.",
    "_id": "SW7FIhGl6eig7PnekaoWDY",
    "contactNo": "+91 9632758985",
    "course": "B.Tech. in  Computer Science and Engineering",
    "achievements": "At IIIT Dharwad, I actively participated in various hackathons, gaining valuable experience and honing my problem-solving skills. I have collaborated with talented peers on several projects and coursework, allowing me to develop both technical and teamwork abilities. These experiences have helped me build resilience and adaptability in challenging situations.",
    "encouragement": "To current and future students, make the most of your time here. IIIT Dharwad offers numerous opportunities to learn, grow, and connect with like-minded individuals. Take part in activities, build your network, and never hesitate to seek help or guidance from the faculty and seniors.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/f25c0cc3948dc2d1b202d85be22830138af5257c-1080x1080.jpg",
    "videoUrl": null,
    "name": "Pravalika Chinthala",
    "email": "cpravalika26@gmail.com"
  },
  {
    "achievements": "- Demonstrated strong technical skills through multiple academic projects, focusing on innovative solutions and real-world applications.\n- Maintained an excellent academic record, showcasing dedication and discipline in core engineering subjects.",
    "memorableExperience": "During my project work, I gained hands-on experience and developed technical skills that were essential for my growth. The guidance from my faculty and access to resources at IIIT Dharwad greatly supported my learning.",
    "encouragement": " Explore new skills, take on challenging projects, and don't hesitate to seek help when needed. With hard work and a positive mindset, you can achieve anything you aim for.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/484baf00bc386e736c4c011f0ed630dc9231b781-1165x1600.jpg",
    "_id": "SW7FIhGl6eig7Pnekbo5s0",
    "email": "saipreethinayak@gmail.com",
    "graduationYear": 2025,
    "testimonial": "IIIT Dharwad has been a transformative place for my academic and personal development. The college provides an outstanding balance between theoretical learning and practical application through projects that challenge students to think innovatively and solve real-world problems. I had the opportunity to work on several academic projects that strengthened my technical skills and prepared me for industry challenges. Beyond academics, the vibrant campus life and active participation extracurricular activities enriched my experience, allowing me to build lasting friendships and develop essential soft skills.",
    "videoUrl": null,
    "name": "Banoth Sai Preethi",
    "contactNo": "+919392975114",
    "designation": "Fourth Year Student",
    "course": "B.Tech. in Electronics and Communication Engineering"
  },
  {
    "videoUrl": null,
    "_id": "VUkuE34wajTefC0u4b5wid",
    "name": "Virinchi Motupalli",
    "contactNo": "+91 8433834494",
    "testimonial": "My time at IIIT Dharwad was a roller coaster ride but very memorable. The best part for me were the peer group I had both amongst my seniors and from my batch. Even some of the juniors were also extremely supportive with my sporting endeavours. Some faculty members were very helpful and supportive throughout my time at this college. The director, whose arrival has changed the college for good is also extremely supportive and the most approachable person amongst the entire college hierarchy who listens to both grievances and suggestions with an open mind. ",
    "memorableExperience": "Discrete mathematics course and first half of the linear algebra course under a former faculty member, Dr. Hariprasad Manjunath. ",
    "email": "virinchi220403@gmail.com",
    "graduationYear": 2025,
    "designation": "Student",
    "course": "B.Tech Data Science and Artificial Intelligence",
    "achievements": "- Qualified for the Synapse 2.0 Hackathon held at PES University, Bangalore",
    "encouragement": "Win, keep your head high, celebrate, one day, two, a week. Then get your head down again and learn train learn.  Lose, keep your head low, mourn, one day, two, a week. Then get your head up again and learn train learn.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/2b86e5f9d8bd830248b7760c8be7a5d59078e0e9-375x506.jpg"
  },
  {
    "_id": "VUkuE34wajTefC0u4bCUEt",
    "email": "22bds011@iiitdwd.ac.in",
    "graduationYear": 2026,
    "designation": "Third Year Student",
    "course": "B.Tech. in Data Science and Artificial Intelligence",
    "achievements": "- Machine Learning Intern at NewMe\n- 1st Place in ML Hackathon at IIEST Shibpur\n- Research Intern at Vanderbilt, USA\n",
    "memorableExperience": " Every moment in life is memorable, but club events like hackathons and coding contests, where you collaborate with friends, are truly special.",
    "encouragement": " Explore as many fields as possible; don't limit yourself to just DSA and Machine Learning.",
    "name": "Ayush Pareek",
    "contactNo": "+919511550174",
    "testimonial": " IIIT Dharwad is an excellent place to learn and grow. It offers opportunities to work with experienced professors who provide guidance and support. The environment encourages exploration of new technologies and helps you push your limits.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/35c583ca1529bc8cd024c0da4dab96116fedec94-444x791.jpg",
    "videoUrl": null
  },
  {
    "name": "Atharva Satish Attarde",
    "contactNo": "+919284646734",
    "email": "asabj3@gmail.com",
    "graduationYear": 2026,
    "designation": "Third Year Student",
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "- Awarded a prestigious NLP internship at ERTS Lab IIT Bombay.\n- Top 10 teams in e-Yantra Robotics Competition (e-YRC 2023-24).\n- Developed an autonomous navigation robot with computer vision, geolocation, image processing, and embedded C.\n- Built and optimized a Retrieval-Augmented Generation (RAG) pipeline by implementing the latest research, developing methods for handling multi-context questions, and creating an autonomous technical document generation system.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/8b4866eff10f7708458f8d483c8ec0f3b9cf7c3b-400x560.jpg",
    "_id": "VUkuE34wajTefC0u4bLpOx",
    "testimonial": "My time at IIIT Dharwad has been immensely rewarding, offering a supportive environment that fosters both academic and personal growth. The college provides a wealth of opportunities, from workshops to hackathons, enabling us to gain essential skills while collaborating with peers from diverse backgrounds. The faculty are not only highly knowledgeable but also incredibly approachable, guiding us through challenges, inspiring innovative ideas, and enhancing our learning experience, especially during hands-on projects. This balanced approach, along with excellent sports facilities and a strong community spirit, has made my journey at IIIT Dharwad both enriching and enjoyable.",
    "memorableExperience": "During the six months of the E-Yantra Robotics competition, my teammates and I worked late into the night, and it was truly inspiring to witness the dedication and creativity each member brought to the table. Our collaborative spirit allowed us to brainstorm and refine unique ideas, which were crucial to our project's success, even in the face of significant challenges. The experience not only highlighted the power of teamwork but also strengthened our bonds as we navigated obstacles together.\n\nAt my internship at IIT Bombay's ERTS Lab, I had the privilege of meeting and working with brilliant individuals who profoundly changed my perspective on the world. Collaborating closely with our mentors, Prof. Kavi Arya and Andrea F., we engaged in lively discussions about the latest research, creating an enjoyable and intellectually stimulating environment. These experiences enriched my knowledge and fostered lasting connections that I will always cherish.",
    "encouragement": "To all the juniors, I encourage you to take advantage of every opportunity you encounter. Our college is incredibly supportive, and the professors are very approachable—please reach out to them and invest in your personal development. Whether it’s participating in competitions or seeking internships, working alongside others who bring diverse ideas can be incredibly rewarding, and you’ll often learn more than you expect from your teammates.",
    "videoUrl": null
  },
  {
    "graduationYear": 2025,
    "designation": "Fourth Year Student",
    "encouragement": "To my juniors at IIIT Dharwad, I encourage you to embrace every opportunity—whether academic, extracurricular, or personal. The resources and support offered here, from dedicated faculty to cutting-edge facilities, are designed to help you excel. Step outside your comfort zone, participate in projects, and make connections. Each experience here will build not only your technical skills but also your resilience and adaptability. Make the most of your journey!",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/b346833bc647b62f835c014f15ced222d41969f4-1024x1024.png",
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "- Participated in the 'Next In' global cricket hackathon in the blockchain and Web3 track.\n- Contributed to projects in deep learning, LLMs, and web development.\n- Worked on question generation, cyber intrusion detection, and real-time chat applications.\n- Strengthened technical and teamwork skills through hands-on experiences.",
    "testimonial": "IIIT Dharwad provides an inspiring learning environment with highly skilled and approachable faculty dedicated to student development. The campus features advanced facilities, including well-equipped labs, a comprehensive library, and collaborative spaces that support both academic and personal growth. This environment has been instrumental in allowing me to pursue my interests with confidence and engage deeply in my studies.",
    "memorableExperience": "One of the most memorable aspects of my time at IIIT Dharwad has been the chance to form strong friendships through shared academic and extracurricular activities. From late-night study sessions to spirited college events, each experience has fostered camaraderie and growth. These events have provided invaluable opportunities to showcase our skills and have created lasting memories that have made my journey at IIIT Dharwad truly unforgettable.",
    "videoUrl": null,
    "_id": "VUkuE34wajTefC0u4bd6N7",
    "name": "Abilash Akkalagari",
    "contactNo": "+918888915165",
    "email": "abilash.goud.24@gmail.com"
  },
  {
    "testimonial": "My time at IIIT was transformative. The curriculum was rigorous and relevant, providing me with a solid foundation in engineering principles. The faculty were incredibly supportive and always willing to help, fostering a collaborative learning environment. Participating in hands-on projects and internships truly prepared me for the workforce. I graduated with confidence and a network of peers that I know will last a lifetime. I highly recommend our college to any aspiring engineer!",
    "memorableExperience": "One of my favorite college memories was our regular basketball sessions at Decathlon—intense, fun, and a great way to unwind. Weekends often meant a trip to Urban Oasis Mall for Marvel movies, where we’d dive into action-packed worlds and leave with plenty to debate. The mix of sports and cinema made those days unforgettable.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/0bb7ae57dbc4d9db7792fc538e5fc75af145fa8a-288x288.png",
    "videoUrl": null,
    "name": "Shivam Kumar",
    "contactNo": "+91 7739801667",
    "email": "kumarshivam292@gmail.com",
    "designation": "SDE - 2",
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "",
    "encouragement": "Make the most of your time here! Embrace challenges, build real friendships, and stay curious—you’re setting the foundation for a lifetime. Enjoy every step and keep pushing forward. You’ve got this!",
    "_id": "VUkuE34wajTefC0u4dqqfa",
    "graduationYear": 2019
  },
  {
    "encouragement": "I understand that it may seem challenging, but believe me when I say that each one of us—every single person—has succeeded and is doing well. You will undoubtedly find your own path to success. With exceptional faculty support, outstanding facilities, and great opportunities ahead of you, you have all the resources you need to thrive.",
    "videoUrl": null,
    "_id": "VUkuE34wajTefC0u4e5q9j",
    "name": "Archana M D",
    "contactNo": "+916361296137",
    "email": "archumd16@gmail.com",
    "course": "B.Tech. in Electronics and Communication Engineering",
    "achievements": "- Successfully cleared the GATE 2021 exam and joined IIT Bombay's Electrical \n- Department for a Master's in Integrated Circuits and Systems. \n- I was offered a position at Google as a Silicon Engineer, standing out as the sole \ncandidate among 200 M.Tech students to receive a placement offer from the company.",
    "testimonial": "As part of the inaugural batch at this college, it has played a pivotal role in shaping my career. The faculty members have made significant individual contributions, providing invaluable support and guidance to each of us. Their dedication has been instrumental in helping us achieve our current successes, fostering an environment where we could thrive and realize our potential. This unique experience has left a lasting impression on my professional journey.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/467d52baf9a79bf2c649867e66b51838bc44b7dd-3024x4032.jpg",
    "graduationYear": 2019,
    "designation": "Silicon DFT Engineer, Google",
    "memorableExperience": "The entire journey has been truly unique, but if I had to highlight one standout experience, it would be the challenge of building everything from the ground up. From establishing various committees to organizing programs and participating in events both on and off campus, I engaged in a wide array of activities. One of the most memorable was the flash mob we organized for women empowerment at Urban Oasis Mall in Hubli. Despite the challenges and difficulties, these experiences have been pivotal in shaping who we are today."
  },
  {
    "contactNo": "+919642629585",
    "graduationYear": 2020,
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "- I represented IIIT Dharwad as Vice Captain for the Volleyball Team in Inter IIIT Sports Fest(Asmita) organized at IIIT Allahabad 2019. \n- Organizer for the Swatchtha Pakhwada Abhiyan. Official Photographer for all the cultural and technical events at IIIT Dharwad (2016-2019).",
    "memorableExperience": "First Ganesh Chathurthi Celebrations in 2016. The First Diwali Celebration in 2016. The First Technical Fest by Techniosys. The fun we had with our seniors on the Industrial Trip to Infosys Campus Mysore. Those daily local transport through bus, running to catch the bus in order to attend the lecture on time. Those night outs before examinations. Some personal trips to Goa, Dandeli with Friends and Juniors. Farewell party to the seniors and Farewell for us by juniors. Those struggles with hostels, food in the early days, labs, mini projects, lab internals, presentations, and playing in BVB College, taking special treats given by all our lecturers.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/d26cb796dc633255db59bbb8e04c4b3c3d7db725-1079x1349.jpg",
    "email": "mukundamaravind@gmail.com",
    "designation": "Software Engineer ",
    "testimonial": "My experience at IIIT Dharwad has been truly transformative. The institute not only offers a robust academic curriculum but also encourages practical exposure, helping students bridge the gap between theory and real-world application. The faculty is highly knowledgeable and approachable, fostering a supportive environment that enables students to explore and deepen their understanding of technology. The campus culture, with its vibrant clubs and technical societies, provides ample opportunities for holistic development. IIIT Dharwad has equipped me with the skills and confidence to excel in the tech industry, and I'm proud to be an alumnus of such a progressive institution.",
    "encouragement": "Don't be stuck without a goal in mind; make yourself clear about where you want to be in the next 5 years after B Tech.  Develop your professional network through social apps like (LinkedIn, Instagram, and Twitter) which will help you in the future. Follow your passion, don't be a sheep in the group. Add new skills to your portfolio in your college days, which will help you in campus and off-campus placements. ",
    "videoUrl": null,
    "_id": "VUkuE34wajTefC0u4e9hlc",
    "name": "Mukundam Aravind"
  },
  {
    "email": "prachitdeshinge324@gmail.com",
    "graduationYear": 2026,
    "achievements": "- Successfully designed and implemented an autonomous navigation vehicle in the E-Yantra Robotics Competition 2023.",
    "testimonial": "With invaluable support from the faculty, staff, and infrastructure at IIIT Dharwad, my team and I successfully developed an autonomous navigation robot. This project utilised advanced technologies such as computer vision, GIS, machine learning, image processing, and embedded C. The resources and guidance provided by IIIT Dharwad were instrumental to our success in the E-Yantra Robotics Competition.",
    "encouragement": "Embrace the journey and learn from each experience. You're building skills that will last a lifetime!",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/49466b891fa27b84779bc7b1cd3d0daba247cd10-413x531.jpg",
    "name": "Prachit Deshinge",
    "designation": "Third Year Student",
    "course": "B.Tech. in Computer Science and Engineering",
    "memorableExperience": "During the E-Yantra Robotics Competition, my teammates and I found ourselves working late into the night, fueled by a mix of excitement and determination. It was truly inspiring to see the dedication and creativity each person brought to the table. Our collaborative spirit turned brainstorming sessions into moments of innovation, and together we tackled some significant challenges. This experience not only showed us the power of teamwork but also deepened our connections as we navigated obstacles side by side. It was a journey that I’ll always remember.",
    "videoUrl": null,
    "_id": "VUkuE34wajTefC0u4fwTqz",
    "contactNo": "+918806651140"
  },
  {
    "graduationYear": 2019,
    "memorableExperience": "My fondest memories from college include participating in hackathons, celebrating each other's birthdays, and playing cricket together. These experiences truly made my time here unforgettable!",
    "encouragement": "The courses are up to date and relevant to industry standards, with a strong emphasis on building a solid foundation. Companies value genuine skills over buzzwords. Embrace innovation and don’t fear failure. Enjoy your college life, make friends, and build connections!",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/600e65745ca51a299271a0a248bb3598966f51f9-920x889.jpg",
    "name": "Abhay Kumar",
    "contactNo": "+917019751181",
    "designation": "Senior Data Engineer",
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "",
    "testimonial": "Studying at this engineering college has been a life-changing experience for me. The dynamic and updated courses, especially in advanced technologies like AI, machine learning, and big data, have provided me with the knowledge and skills necessary to excel in today’s competitive job market. The supportive environment encourages both learning and personal growth, allowing us to pursue our interests and build lasting relationships. I’ve made friends for life here, and I genuinely believe this college has laid a strong foundation for my future. I couldn’t have asked for a better start!",
    "videoUrl": null,
    "_id": "VUkuE34wajTefC0u4iPMAd",
    "email": "abhaykm795@gmail.com"
  },
  {
    "name": "Venkata Sai Nikhil",
    "course": "B.Tech. in  Computer Science and Engineering",
    "testimonial": "At IIIT Dharwad, I found a group of passionate and dedicated individuals who provided tremendous support and motivation. The hands-on projects offered invaluable experience, helping me build the skills that prepared me for my current role. To students, I would say: Find a group of like-minded, motivated individuals who share your passions. This way, you can make meaningful progress while truly enjoying your college experience.",
    "photoUrl": null,
    "videoUrl": null,
    "_id": "VUkuE34wajTefC0u4kkurb",
    "contactNo": "+91 9381407479",
    "email": "vvsnikhil22@gmail.com",
    "graduationYear": 2024,
    "designation": "Software Engineer @MAQ Software",
    "achievements": "- Qualified for GATE",
    "memorableExperience": "One of my most unforgettable experiences was our final trip to Gokarna and Chikmagalur. We planned it knowing it would likely be one of our last chances to make memories together before graduation. Every moment was amazing, and we cherished each second, realizing we wouldn’t have this time with each other again. The laughter, shared adventures, and sense of togetherness made it truly unforgettable, and I’ll always look back on that trip with a smile.",
    "encouragement": "If you feel behind on DSA or development, remember it’s never too late! Start with the basics using resources like Striver or Neetcode—pick one, follow it consistently, and focus on implementing algorithms to build practical skills. Begin applying for jobs and internships, and attend as many interviews as you can. Each interview, even if challenging, boosts your confidence and prepares you for the next opportunity. Don’t view setbacks as failures; see them as valuable experience. Keep pushing forward, and progress will follow—cheers!"
  },
  {
    "graduationYear": 2024,
    "achievements": "- Have been part of NCC and NSS during college days as well as Part of football team representing college in inter IIIT sports meet.",
    "testimonial": "My college time has been truly transformative. The supportive friends and faculty, and diverse extracurricular opportunities have shaped me both personally and professionally.",
    "memorableExperience": "Inter IIIT is my most memorable experience along with different trips with my friends.",
    "name": "Anmol Singh",
    "contactNo": "+918890332471",
    "email": "anmolsingh1089@gmail.com",
    "designation": "Software developer ",
    "course": "B.Tech. in Computer Science and Engineering",
    "encouragement": "To all juniors, enhance every challenge and opportunity to grow. Stay focused and push yourself out of your comfort zone. The journey ahead will be full of learning and experiences. Always there for you.",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/66180d491a8a14cd8f540c652eb78badf19c411c-1002x990.jpg",
    "videoUrl": null,
    "_id": "VWkKPc20DpnhdCi8xbCZA7"
  },
  {
    "designation": "Third Year Student",
    "course": "B.Tech. in Computer Science and Engineering",
    "achievements": "- AlgoUniversity Tech Fellowship (ATF) 2024: Ranked in the top 20% of over 20,000 applicants, showcasing technical skills.\n- Microsoft AI Odyssey Completion: One of the top 5% to complete both levels, with generative AI reflections featured on the Azure Developer Community YouTube channel.\n- Exclusive Invitation to Infosys Springboard Summit 2024: Invited to present my project, network with industry leaders, and explore 'Infosys on Wheels.'\n- 3rd Place in IIT Dharwad’s DSA Competition: Secured third place, reinforcing problem-solving skills.",
    "memorableExperience": "- IIIT Dharwad has been transformative, with faculty, seniors, and juniors who feel like family.\n- Participated & won in events at IIT Dharwad and IIT Bombay, celebrating achievements.\n- Treasured the peaceful environment, sunsets, stargazing by the lake, and working on an aeroponics project.\n- Enjoyed festivals, moonlit nights, and singing with friends, creating unforgettable memories.\n",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/784110b370fa13994970f844f6880ddc023cd008-1454x1455.jpg",
    "email": "Aryanjstar3@gmail.com",
    "graduationYear": 2026,
    "testimonial": "IIIT Dharwad has provided me with an inspiring environment to grow both personally and professionally. As the founder of the MLSA Chapter and Prabodhini Club, I had the opportunity to build communities that focused on sharing knowledge and fostering leadership. I was also elected to work on Harleygrow, an aeroponics & hydroponics startup, where I contributed to website content, planning, and setting up operations from scratch. The college’s supportive atmosphere, with faculty and peers who feel like family, has allowed me to gain essential skills in leadership, communication, and teamwork. These opportunities here have fueled my passion and helped shape who I am today.",
    "encouragement": "- Embrace college opportunities and seek guidance from supportive seniors.\n- Join clubs and communities to build leadership and communication skills.\n- Balance academics and well-being for a well-rounded experience.\n- Make the most of your talents, and take every opportunity to grow.\n- Best wishes for a successful journey!",
    "videoUrl": null,
    "_id": "d4LpQaO8lWSqUgPSaW7m6U",
    "name": "Aryan Jaiswal",
    "contactNo": "+919794771263"
  },
  {
    "course": "B.Tech. in Computer Science and Engineering",
    "testimonial": "This college has provided me with numerous opportunities and has helped me grow in my career. I've learned so much as a part of IIIT Dharwad, and participating in both technical and cultural activities has given me confidence.",
    "encouragement": "I strongly encourage students to actively participate in technical and cultural activities, explore new technologies, take part in hackathons, organize seminars or workshops, and, most importantly, communicate with their seniors",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/b0d931eaa44f4f4cb96e1dd150d5032a39b0739f-2604x2788.jpg",
    "videoUrl": null,
    "name": "Nancy Yadav",
    "contactNo": "+919024225365",
    "email": "ynancy030@gmail.com",
    "designation": "Fourth Year Student",
    "achievements": "- Achieved second place in CSS Battles, competing among over 50 participants.",
    "memorableExperience": "One of my most memorable experiences was participating in the hackathon organized by the institute. It was my first offline hackathon, and I thoroughly enjoyed it, the experience was truly remarkable",
    "_id": "d4LpQaO8lWSqUgPSaYTmaM",
    "graduationYear": 2025
  },
  {
    "name": "Gorle Nikhil",
    "contactNo": "+916304761191",
    "designation": "Final Year Student",
    "achievements": "- Selected for Amazon Machine Learning Summer School, gaining exposure to advanced ML concepts.\n- Qualified for Aryabhatta National Maths Competition 2024, enhancing my math skills through a competitive experience.",
    "encouragement": "As seniors, we get the chance to guide and motivate juniors by sharing what we've learned and the experiences we've had. Helping them build a good personality and succeed in their studies can really make a difference. Juniors often look up to us, so I want to set a good example they can actually relate to. Let’s help each other aim for good grades and CGPAs, and work on the skills and values that will take us far in life!",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/f82cdcdc93e111f99afe168b20d9acc9ce7c5558-995x1280.jpg",
    "videoUrl": null,
    "_id": "d4LpQaO8lWSqUgPSaangZu",
    "email": "nikhil.gorle2002@gmail.com",
    "graduationYear": 2025,
    "course": "B.Tech. in Computer Science and Engineering",
    "testimonial": "My experience here from gaining knowledge in classrooms to making unforgettable memories with friends, every moment has shaped me into who I am today. I’m grateful for the opportunities and the support from friends that have made this journey meaningful. This place will always hold a special place in my heart.",
    "memorableExperience": "M block is where we became friends and made memories. I’ll never forget it all. Those late-night hangouts, the laughter, and the fun we had together—these are moments we’ll always remember."
  },
  {
    "contactNo": "+91 8530522755",
    "email": "pratikpakhale20@gmail.com",
    "designation": "Student",
    "testimonial": "I think the best part of being at IIIT is the kind of community and crowd we have. Being a new and small college, all the people are from the same domain, so we always learn and grow together, helping each other out. The faculties are much helpful and supportive here, be it in a technical perspective or non technical one, they're always ready to help and provide opportunities for us!",
    "memorableExperience": "Spending time with friends, hosting and attending events!",
    "encouragement": "Never hesitate to ask questions. ",
    "_id": "piyJAhpB4yoL7s3CRcJ9fx",
    "name": "Pratik Pakhale",
    "graduationYear": 2025,
    "course": "Computer Science and Engineering",
    "achievements": "- Research Intern at IIT Bombay \n- GSoC Participant for the PEcAn Project \n- IIIT Dharwad Shark Tank Winner \n- Postman Go w/ Flow Hackathon Winner \n- IIIT Dharwad Hack2Future Pan India Hackathon Winner",
    "photoUrl": "https://cdn.sanity.io/images/t3mxm1b8/production/1cfaf158750728fde16626c266127540e90f1c9a-4000x4000.jpg",
    "videoUrl": null
  }
]
